[
  {
    "title": "General Provisions",
    "content": []
  },
  {
    "title": "Parliament",
    "content": [
      {
        "chapter": "Composition",
        "content": [
          {
            "article": "Number of Members of Parliament",
            "content": "In accordance with Article 32, Section 1, and with Article 74 of the 2022 Constitution of the Bayer Free State, on the first day of the month of May, in the year two thousand and twenty-two and forever after, there shall be five seats in Parliament.",
            "source": "No. 5 of 2022",
            "note": "",
            "articleId": "crwhf"
          }
        ]
      },
      {
        "chapter": "Parliamentary Procedures",
        "content": [
          {
            "part": "Scope; Definitions",
            "content": [
              {
                "article": "Scope",
                "content": "This [Chapter] shall apply to any business conducted by Parliament as authorized by statute.",
                "source": "No. 12 of 2022, Article 1",
                "note": "",
                "articleId": "vvvhG"
              },
              {
                "article": "Definitions",
                "content": "For the purpose of this [Chapter]:\r\n<ol class=\"clause\"><li>“The Chair” shall refer to the position, powers, and duties as defined by this [Chapter], which is held and discharged by a person authorized by this [Chapter].</li><li>“The Speaker” shall refer to the person elected by Parliament to the Chair, and to exercise the powers and duties thereof on a regular basis.</li><li>“A Member” shall refer to a Member of Parliament.</li></ol>",
                "source": "No. 12 of 2022, Article 2",
                "note": "",
                "articleId": "fBXzr"
              }
            ]
          },
          {
            "part": "The Speaker",
            "content": [
              {
                "article": "Election of the Speaker",
                "content": "Whenever the Chair is vacant, a Speaker shall be elected by a majority in Parliament after being nominated by a Member.",
                "source": "No. 12 of 2022, Article 3",
                "note": "",
                "articleId": "2lsk6"
              },
              {
                "article": "Delegation of Speaker Power",
                "content": "For good cause, the Chair may temporarily delegate its powers and duties to any Member for no more than fourteen days. A written notice from the Chair shall be made to Parliament before the delegated member may act on behalf of the Chair.",
                "source": "No. 12 of 2022, Article 4",
                "note": "",
                "articleId": "vqkMP"
              },
              {
                "article": "Acting Speaker during Vacancy",
                "content": "During the vacancy of the Chair, the Member that came first or the closest to first in the closest parliamentary election shall assume the powers and duties of the Chair until a new Speaker is elected to act on behalf of the Chair according to this [Chapter].",
                "source": "No. 12 of 2022, Article 5",
                "note": "",
                "articleId": "C60Yn"
              },
              {
                "article": "Affirmation of the Previous Speaker",
                "content": "If Parliament is content with the Speaker of the previous Parliament, it shall affirm by a majority.",
                "source": "No. 12 of 2022, Article 6",
                "note": "",
                "articleId": "MgspR"
              },
              {
                "article": "Motion of Removal of the Speaker",
                "content": "On substantial grounds, any Member may submit a motion to remove the current Speaker from the Chair. The Speaker shall be removed if Parliament approves the motion by a two-thirds majority.",
                "source": "No. 12 of 2022, Article 7",
                "note": "",
                "articleId": "CRf35"
              }
            ]
          },
          {
            "part": "Formation and Dissolution of Parliament",
            "content": [
              {
                "article": "Formation of Parliament",
                "content": "After the publication of results of a parliamentary election, a new parliament shall automatically be formed. The new Members of Parliament shall be given their appropriate role at the earliest possible opportunity, and they shall convene at the earliest opportunity. At the earliest opportunity, the first business of Parliament shall be the election of a Speaker, or the confirmation of the previous Speaker, followed by the appointment of a Prime Minister.",
                "source": "No. 12 of 2022, Article 8",
                "note": "",
                "articleId": "dXLF0"
              },
              {
                "article": "Dissolution of Parliament",
                "content": "Section 1\r\nWhenever Parliament is required by statute to be dissolved, the Speaker shall timely make a notice to and declare that Parliament is dissolved. The role of the Members shall be taken away at the earliest possible opportunity.\r\nSection 2\r\nIf there is any business which has not concluded before Parliament is dissolved, a Member may move that the business be continued in the next parliament.",
                "source": "No. 12 of 2022, Article 9",
                "note": "",
                "articleId": "Vxgfc"
              },
              {
                "article": "Emergency Reassembly of Parliament",
                "content": "After Parliament has been dissolved but no new Parliament has yet been formed, during an emergency, the Chair may, for good cause, order that Parliament be reassembled for a determined period of time. Upon being reassembled, Parliament shall confirm the reassembly and the period of time by a two-thirds majority.",
                "source": "No. 12 of 2022, Article 10",
                "note": "",
                "articleId": "jyZjG"
              }
            ]
          },
          {
            "part": "Venue",
            "content": [
              {
                "article": "Public Venue",
                "content": "Any proceeding in Parliament shall only be considered valid if it takes place in a venue available for public viewing at all time.",
                "source": "No. 12 of 2022, Article 11",
                "note": "",
                "articleId": "qWHMr"
              },
              {
                "article": "Change of Venue",
                "content": "Parliament may, for good cause, change the venue by a motion. The new venue shall satisfy the requirement set out in [BFSC].",
                "source": "No. 12 of 2022, Article 12",
                "note": "",
                "articleId": "fkrnh"
              },
              {
                "article": "Motion for Private Debate",
                "content": "Notwithstanding [BFSC], Parliament may, for national interest and security, or under extraordinary circumstances, temporarily conduct its business in private by a motion. Any private proceeding under this Article shall be considered fully valid and must be reported in the usual public venue at the earliest appropriate opportunity.",
                "source": "No. 12 of 2022, Article 13",
                "note": "",
                "articleId": "jsSZn"
              }
            ]
          },
          {
            "part": "Questions, Motions, Acts and Statements",
            "content": [
              {
                "article": "When to Submit Questions, Motions, Acts, or Statements",
                "content": "Parliament shall always be considered open to submit any question, motion, act or statement.",
                "source": "No. 12 of 2022, Article 14",
                "note": "",
                "articleId": "GDcJs"
              },
              {
                "article": "Notice of Questions, Motions, Acts, and Statements",
                "content": "A notice to Parliament shall be made when a question, motion, act, or statement is introduced.",
                "source": "No. 12 of 2022, Article 15",
                "note": "",
                "articleId": "r9tN3"
              },
              {
                "article": "Motion",
                "content": "Any action by Parliament taken under any act shall be done by a motion.",
                "source": "No. 12 of 2022, Article 16",
                "note": "",
                "articleId": "sH6xJ"
              },
              {
                "article": "Amendment to Proposed Acts",
                "content": "Any Member may submit an amendment to a proposed act at any time, which shall be timely followed by a notice to Parliament.",
                "source": "No. 12 of 2022, Article 17",
                "note": "",
                "articleId": "jK6gr"
              },
              {
                "article": "Questions",
                "content": "Any question for any Member or other government officers shall be answered at the earliest possible opportunity, and may be followed by any follow-up question or debate submitted by any Member.",
                "source": "No. 12 of 2022, Article 18",
                "note": "",
                "articleId": "klhzh"
              },
              {
                "article": "Debate",
                "content": "Following any question, motion, act, and statement, unless stated otherwise by this [Chapter], Members shall be allowed to freely debate on any question, motion, act, and statement as they please. Questions may be made by any Member during a debate.",
                "source": "No. 12 of 2022, Article 19",
                "note": "",
                "articleId": "BPCPW"
              },
              {
                "article": "Postponement or Adjournment of Debate",
                "content": "At any point before or during a debate on a motion or an act, the Chair, upon a Member’s request, may, for good cause, postpone or adjourn the debate until no more than thirty days later.",
                "source": "No. 12 of 2022, Article 20",
                "note": "",
                "articleId": "T5SK3"
              }
            ]
          },
          {
            "part": "Voting",
            "content": [
              {
                "article": "Time of Voting",
                "content": "Section 1\r\nA vote on a motion may take place at the earliest possible opportunity.\r\nSection 2 \r\nA vote on an act may only take place between 6AM on a Saturday and 6PM UTC+7 the following Sunday.",
                "source": "No. 12 of 2022, Article 21",
                "note": "",
                "articleId": "fgbmd"
              },
              {
                "article": "Change of Time of Voting",
                "content": "Upon a Member’s request, the Chair may, for good cause, temporarily change any time set out in [BFSC].",
                "source": "No. 12 of 2022, Article 22",
                "note": "",
                "articleId": "XLsnn"
              },
              {
                "article": "Minimum Time Requirement for Debate and Consideration of Motions and Acts",
                "content": "Section 1\r\nUnless permitted by the Chair under extraordinary circumstances, no vote on a motion shall take place until at least five minutes after it was introduced.\r\nSection 2\r\nUnless permitted by the Chair under extraordinary circumstances, no vote on an act shall take place until at least one hour after it was introduced.",
                "source": "No. 12 of 2022, Article 23",
                "note": "",
                "articleId": "BlKhz"
              },
              {
                "article": "When to Vote",
                "content": "A vote on a motion or an act shall take place when it is called by the Chair upon a Member’s request. No vote on a motion or an act shall be requested until all debate on the motion or act has concluded.",
                "source": "No. 12 of 2022, Article 24",
                "note": "",
                "articleId": "wwLqy"
              },
              {
                "article": "Duration of Vote",
                "content": "A vote on a motion or an act shall last no less than fifteen minutes, and no more than twenty-four hours. The duration of the vote shall be determined appropriately by the Chair. For good cause, any Member may request that the duration of the vote be changed by the Chair.",
                "source": "No. 12 of 2022, Article 25",
                "note": "",
                "articleId": "T0ZgB"
              },
              {
                "article": "Where to Vote",
                "content": "Unless proceedings are taking place in private under [BFSC], all voting on an act or a motion shall only be considered valid if it takes place in a public venue.",
                "source": "No. 12 of 2022, Article 26",
                "note": "",
                "articleId": "bm4xL"
              },
              {
                "article": "How to Vote",
                "content": "Unless proceeding is taking place in private under [BFSC], all votes on an act or a motion shall be publicly signified and recorded. a Member shall vote by making a notice to Parliament, stating that they are voting, and their voting intent.",
                "source": "No. 12 of 2022, Article 27",
                "note": "",
                "articleId": "1rPcf"
              },
              {
                "article": "Proxy Vote",
                "content": "For good cause, a Member may cast a vote on a motion or an act on behalf of another Member with the permission of that Member. a Member shall vote on behalf of another Member by making a notice to Parliament, stating that they are voting on behalf of another Member, the Member they are voting on behalf of, the voting intent of that Member, and any proof of authenticity and authorization. A Member of whom another Member cast a vote on behalf may dispute the authenticity and authorization of their proxy vote within three days of the vote being cast in Parliament.",
                "source": "No. 12 of 2022, Article 28",
                "note": "",
                "articleId": "xTNs1"
              },
              {
                "article": "Threshold",
                "content": "Unless stated otherwise by statutes, a motion or an act shall require a majority of the votes of Parliament to be enacted.",
                "source": "No. 12 of 2022, Article 29",
                "note": "",
                "articleId": "wV1Q5"
              },
              {
                "article": "Declaration of Results",
                "content": "After voting has concluded on a motion or an act, the Chair, without unnecessary delay, shall announce the results of the vote to Parliament, and to declare the status of the proposed motion or act.",
                "source": "No. 12 of 2022, Article 30",
                "note": "",
                "articleId": "8tqSG"
              }
            ]
          },
          {
            "part": "Order in Parliament",
            "content": [
              {
                "article": "Irrelevance or Repetition",
                "content": "The Chair, after having called the attention of a Member, to the conduct of a Member who persists in irrelevance, or tedious repetition either of their own arguments or of the arguments used by other Members in debate, may direct them to discontinue their speech.",
                "source": "No. 12 of 2022, Article 31",
                "note": "",
                "articleId": "yfwfm"
              },
              {
                "article": "Time Limit on Debate",
                "content": "The Chair, for the orderly conduct of business, upon the request of a Member, may impose, lift, or change an appropriate time limit on the debate of a Member or Members on a motion or an act at any point before or during the debate.",
                "source": "No. 12 of 2022, Article 32",
                "note": "",
                "articleId": "p4BgG"
              },
              {
                "article": "Point of Order",
                "content": "At any time, a Member may draw the attention of the Chair to the misconduct of another Member by raising a point of order. Unless the Chair permits, there shall be no debate to a point of order. The Chair shall immediately consider the point of order, and shall take immediate appropriate action according to the point of order.",
                "source": "No. 12 of 2022, Article 33",
                "note": "",
                "articleId": "hNT4G"
              },
              {
                "article": "Suspension of Member of Parliament",
                "content": "​​The Chair shall order any Member or Members whose conduct is grossly disorderly to immediately be removed from Parliament for no more than seven days.",
                "source": "No. 12 of 2022, Article 34",
                "note": "",
                "articleId": "kLXsL"
              },
              {
                "article": "Suspension of Member of the Public",
                "content": "​​The Chair shall order any member or members of the public whose conduct is grossly disorderly to immediately be removed from Parliament for no more than fourteen days. The Chair may also order that the thread of that member of the public be archived or deleted.",
                "source": "No. 12 of 2022, Article 35",
                "note": "",
                "articleId": "zvdzn"
              },
              {
                "article": "Suspension of Debate",
                "content": "A Member may submit a motion that the debate on a motion or an act be suspended. There shall be no debate to that motion, and the motion shall be considered immediately by Parliament. The Chair shall inform the Member that a motion that the debate be suspended is one of the most exceptional measures taken by Parliament, that Parliament shall not consent to such motion unless it is the only possible way in which proper orderly business of Parliament can be conducted, and that such motion is not debatable; and shall ask the Member whether or not they still wish to proceed with their motion. If the Member still wishes to proceed, the motion shall be immediately put to voting in Parliament. If Parliament approves the motion by a two-thirds majority, no further debate on the specified motion or act shall be permitted.",
                "source": "No. 12 of 2022, Article 36",
                "note": "",
                "articleId": "xgmnn"
              },
              {
                "article": "Contempt of Parliament",
                "content": "A Member may submit a motion that a person be held in contempt of Parliament for interfering with or misusing parliamentary privilege or obstructing Parliament from conducting its business. The motion shall be considered immediately by Parliament. If Parliament approves the motion by a two-thirds majority, that person shall be suspended or expelled from Parliament, referred to an impeachment proceeding from any office, or referred to a criminal court for trial.",
                "source": "No. 12 of 2022, Article 37",
                "note": "",
                "articleId": "csQCM"
              }
            ]
          },
          {
            "part": "Members of the Public",
            "content": [
              {
                "article": "Public Participation",
                "content": "Any member of the public may, in good conduct, engage in any constructive and civil debate in Parliament as permitted by the Chair in the form of a thread.",
                "source": "No. 12 of 2022, Article 38",
                "note": "",
                "articleId": "7N4PF"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "title": "The Executive Branch",
    "content": []
  },
  {
    "title": "Flags, Coat of Arms, Seals, and Symbols of the Government",
    "content": []
  },
  {
    "title": "The Server",
    "content": [
      {
        "chapter": "Procedures for Exercising Administrator Powers",
        "content": [
          {
            "part": "Scope; Definition",
            "content": [
              {
                "article": "Scope; Definition",
                "content": "Section 1\r\nThis [Chapter] shall apply to any person who is authorized to hold some or all administrative powers within the guild, and any administrative action taken by them.\r\nSection 2\r\nFor the purpose of this [Chapter], a person to whom this [Chapter] applies as provided in Section 1 of this Article shall be referred to as an “administrator”.",
                "source": "No. 13 of 2022, Article 1",
                "note": "",
                "articleId": "wzys3"
              }
            ]
          },
          {
            "part": "Guild",
            "content": [
              {
                "article": "Name and Icon",
                "content": "The name and icon of the guild shall not be changed unless the change is authorized by a public referendum.",
                "source": "No. 13 of 2022, Article 2",
                "note": "",
                "articleId": "TzQy3"
              },
              {
                "article": "Role Settings",
                "content": "Section 1\r\nNo role which grants or overrides any permission of any member shall be created, deleted, or edited unless authorized by Parliament.\r\nSection 2\r\nAn administrator may, for plausible cause, within a reasonable limit, and upon a member’s request, create, delete, or edit any role which does not grant or override the permission of any member.",
                "source": "No. 13 of 2022, Article 3",
                "note": "",
                "articleId": "WPyDJ"
              },
              {
                "article": "Custom Emojis",
                "content": "An administrator may add, edit, or remove any emojis they deem proper and appropriate.",
                "source": "No. 13 of 2022, Article 4",
                "note": "",
                "articleId": "KySCk"
              },
              {
                "article": "Template",
                "content": "An administrator may update the template of the guild as they deem proper and appropriate.",
                "source": "No. 13 of 2022, Article 5",
                "note": "",
                "articleId": "CKNwf"
              },
              {
                "article": "Enabling Community and Discovery",
                "content": "The Community and Discovery features shall not be enabled unless authorized by a public referendum.",
                "source": "No. 13 of 2022, Article 6",
                "note": "",
                "articleId": "yYc00"
              },
              {
                "article": "Invites",
                "content": "At any time, there shall be only one permanent invite to the guild.",
                "source": "No. 13 of 2022, Article 7",
                "note": "",
                "articleId": "dSNgQ"
              },
              {
                "article": "Bots",
                "content": "Section 1\r\nNo bot which is granted any or all administrative powers shall be invited to the guild unless authorized by Parliament.\r\nSection 2\r\nAn administrator may add any bot which is not granted any administrative power to the guild as they deem proper and appropriate.",
                "source": "No. 13 of 2022, Article 8",
                "note": "",
                "articleId": "T44jq"
              },
              {
                "article": "Events",
                "content": "An administrator may create, edit, and delete any event as they deem proper and appropriate.",
                "source": "No. 13 of 2022, Article 9",
                "note": "",
                "articleId": "8MLYN"
              },
              {
                "article": "Official Announcements",
                "content": "An administrator may make, edit, and delete any announcement in the designated channel as they deem proper and appropriate. No member or group of members shall be pinged in an announcement without good cause.",
                "source": "No. 13 of 2022, Article 10",
                "note": "",
                "articleId": "vzwv4"
              }
            ]
          },
          {
            "part": "Channels and Categories",
            "content": [
              {
                "article": "Creation and Deletion",
                "content": "No channel or category shall be created or deleted unless authorized by Parliament.",
                "source": "No. 13 of 2022, Article 11",
                "note": "",
                "articleId": "xs9Px"
              },
              {
                "article": "Name and Topic",
                "content": "An administrator may edit the name and topic of any channel or category as they deem proper and appropriate.",
                "source": "No. 13 of 2022, Article 12",
                "note": "",
                "articleId": "QlRvh"
              },
              {
                "article": "Position on the Channel List",
                "content": "An administrator may change the position of any channel or category on the channel list as they deem proper and appropriate.",
                "source": "No. 13 of 2022, Article 13",
                "note": "",
                "articleId": "gWH5b"
              },
              {
                "article": "Slowmode",
                "content": "No configuration of slowmode shall be altered or imposed on any channel unless authorized by Parliament.",
                "source": "No. 13 of 2022, Article 14",
                "note": "",
                "articleId": "pZB1K"
              },
              {
                "article": "NSFW",
                "content": "No configuration of age-restriction shall be altered or imposed on any channel unless authorized by Parliament.",
                "source": "No. 13 of 2022, Article 15",
                "note": "",
                "articleId": "zQ3r2"
              },
              {
                "article": "Permissions",
                "content": "The permissions of any channel or category shall not be altered unless authorized by Parliament.",
                "source": "No. 13 of 2022, Article 16",
                "note": "",
                "articleId": "YqkSQ"
              },
              {
                "article": "Integrations",
                "content": "An administrator may install, alter, or remove any integrations of any channel as they deem proper and appropriate.",
                "source": "No. 13 of 2022, Article 17",
                "note": "",
                "articleId": "b0LDQ"
              }
            ]
          },
          {
            "part": "Messages",
            "content": [
              {
                "article": "Deletion",
                "content": "No message shall be deleted without the consent of the author or probable cause.",
                "source": "No. 13 of 2022, Article 18",
                "note": "",
                "articleId": "Mqbtr"
              },
              {
                "article": "Removal of Reactions",
                "content": "No reaction of a message shall be removed without the consent of the author or probable cause.",
                "source": "No. 13 of 2022, Article 19",
                "note": "",
                "articleId": "mw3Gz"
              },
              {
                "article": "Pinning",
                "content": "An administrator may pin or unpin any message in any channel as they deem proper and appropriate.",
                "source": "No. 13 of 2022, Article 20",
                "note": "",
                "articleId": "mZJMB"
              }
            ]
          },
          {
            "part": "Members",
            "content": [
              {
                "article": "Nickname",
                "content": "No nickname of any member shall be created, altered, or removed without the consent of that member.",
                "source": "No. 13 of 2022, Article 21",
                "note": "",
                "articleId": "XPzls"
              },
              {
                "article": "Roles",
                "content": "Section 1\r\nNo role which grants or overrides the permission of a member shall be added to or removed from that member unless authorized by statute.\r\nSection 2\r\nNo role which does not grant or override the permission of a member shall be added to or removed from that member without their consent.",
                "source": "No. 13 of 2022, Article 22",
                "note": "",
                "articleId": "80Qys"
              },
              {
                "article": "Muting and Deafening",
                "content": "Without the authorization of a court, no member may be server muted or deafened without probable cause and for more than fifteen minutes.",
                "source": "No. 13 of 2022, Article 23",
                "note": "",
                "articleId": "Gympd"
              },
              {
                "article": "Timeout, Kicking, and Banning",
                "content": "Without the authorization of a court, no member may be put in timeout, kicked, or banned without probable cause and for more than sixty minutes. At the earliest opportunity, the administrator responsible shall make a notice to a court and apply for a warrant if necessary at the earliest possible opportunity.",
                "source": "No. 13 of 2022, Article 24",
                "note": "",
                "articleId": "Rf77X"
              }
            ]
          },
          {
            "part": "The Audit Log; Report to Parliament",
            "content": [
              {
                "article": "Authorized Personnels",
                "content": "Members of Parliament, the Chief Justice, Members of the Election Commission, and any other person authorized by statute shall be granted unobstructed access to the audit log.",
                "source": "No. 13 of 2022, Article 25",
                "note": "",
                "articleId": "LRVCj"
              },
              {
                "article": "Review of the Audit Log",
                "content": "Any person authorized may regularly review the audit log, and may freely raise any question regarding the administrative action of an administrator, and the administrator responsible shall answer the question at the earliest possible opportunity.",
                "source": "No. 13 of 2022, Article 26",
                "note": "",
                "articleId": "g0dy8"
              },
              {
                "article": "Obstruction of Access to the Audit Log",
                "content": "Any administrator obstructing the access of any Member of Parliament to the audit log shall be held in contempt of Parliament. Any administrator obstructing the access of any authorized person to the audit log shall be prosecuted by statute.",
                "source": "No. 13 of 2022, Article 27",
                "note": "",
                "articleId": "MqyyW"
              },
              {
                "article": "Report to Parliament",
                "content": "An administrator shall, on a regular basis, report to Parliament any major administrative action and answer any question raised by any Member of Parliament regarding that action.",
                "source": "No. 13 of 2022, Article 28",
                "note": "",
                "articleId": "DjryB"
              }
            ]
          },
          {
            "part": "Archive and Protection",
            "content": [
              {
                "article": "Protection of Historical Channels, Categories, Roles, Messages, and Emojis",
                "content": "Notwithstanding any article of this [Chapter], no channels, categories, roles, messages, and emojis created more than ninety days prior shall be deleted or edited unless authorized by Parliament.",
                "source": "No. 13 of 2022, Article 29",
                "note": "",
                "articleId": "yDzps"
              },
              {
                "article": "Channel Archive",
                "content": "Parliament may order that a channel be archived by moving it to the designated category and overriding the permission of any member to alter the content of it. An archived channel shall not be deleted or unarchived unless authorized by Parliament.",
                "source": "No. 13 of 2022, Article 30",
                "note": "",
                "articleId": "fXr61"
              },
              {
                "article": "Emoji Archive",
                "content": "Before deleting any custom emoji, an administrator shall download a copy of that emoji and ensure that the copy is accessible to the public.",
                "source": "No. 13 of 2022, Article 31",
                "note": "",
                "articleId": "cyBKb"
              }
            ]
          },
          {
            "part": "General Provisions",
            "content": [
              {
                "article": "Public Referendums",
                "content": "A public referendum required as provided by any article of this [Chapter] shall be authorized by Parliament and be held and administered by the Election Commission.",
                "source": "No. 13 of 2022, Article 32",
                "note": "",
                "articleId": "hSg1n"
              },
              {
                "article": "Proper and Appropriate",
                "content": "An administrative action shall only be taken in the interests of the public or the State.",
                "source": "No. 13 of 2022, Article 33",
                "note": "",
                "articleId": "jTqlV"
              },
              {
                "article": "Objection by Parliament",
                "content": "Parliament may, by a motion, order that an administrative action be reversed. An administrator shall reverse that administrative action immediately after being ordered by Parliament.",
                "source": "No. 13 of 2022, Article 35",
                "note": "",
                "articleId": "sSd5T"
              },
              {
                "article": "Emergency",
                "content": "Notwithstanding any article of this [Chapter], an administrator may, for probable cause during an emergency under extraordinary circumstances, take any appropriate administrative action without the usual process and authorization provided by any article of this [Chapter] to ensure and protect the existence, security, order, and interests of the State and the public. Any administrative action taken under this Article shall be reported immediately at the earliest possible opportunity to Parliament, and Parliament shall be provided with an explanation for the action.",
                "source": "No. 13 of 2022, Article 36",
                "note": "",
                "articleId": "CG9tx"
              }
            ]
          }
        ]
      },
      {
        "chapter": "Not-safe-for-work Channels",
        "content": [
          {
            "article": "Definitions",
            "content": "[In this Chapter:]\n<ol type=\"a\"><li>The term \"sexual content\" includes content which contains nudity, intense sexuality, or other sexually suggestive subject matter in all formats (images, videos, audio, text, links, etc...).</li><li>The term \"gore content\" includes disturbing or unsettling content which contain blood, organs, severe injuries, suicides, tortures or other potentially disturbing subject matter in all formats (images, videos, audio, text, links, etc...).</li></ol>",
            "source": "RES_3-5-2021/00003, DEFINITION",
            "note": "",
            "articleId": "3bVHQ"
          },
          {
            "article": "Designation of #not-shitty-for-wall",
            "content": "#not-shitty-for-wall shall now be reserved for sexual content strictly.",
            "source": "RES_3-5-2021/00003, 1.",
            "note": "",
            "articleId": "XwVBn"
          },
          {
            "article": " Creation and Designation of #mental-asylum",
            "content": "A new channel shall be created dedicated to gore content.",
            "source": "RES_3-5-2021/00003, 2.",
            "note": "The channel referred to by this provision is now #mental-asylum.",
            "articleId": "86Ks7"
          }
        ]
      }
    ]
  },
  {
    "title": "Immigration and Citizenship",
    "content": [
      {
        "chapter": "Establishment of the Immigration Board",
        "content": [
          {
            "article": "Establishment of the Immigration Board",
            "content": "An Immigration Board shall be established under the administration of the Head of State, the Prime Minister, or any executive department.",
            "source": "No. 4 of 2022, Article 1",
            "note": "",
            "articleId": "g4Qql"
          },
          {
            "article": "Composition of the Immigration Board",
            "content": "The Immigration Board shall consist of the Head of State, the Prime Minister, and a citizen appointed by the Prime Minister, who shall serve until the end of the term of the Prime Minister, resignation, or recall by the Prime Minister.",
            "source": "No. 4 of 2022, Article 2",
            "note": "",
            "articleId": "6bTpg"
          },
          {
            "article": "Duty of the Immigration Board",
            "content": "The Immigration board shall have the duty of\r\n<ol class=\"clause\"><li>Researching, analyzing, and deciding on citizenship and residential permit applications, petitions, suspensions, and revocations;</li><li>Determining the criteria for citizenship and residential permit eligibility that does not interfere with a person's inalienable rights;</li><li>Leading, prosecuting, or assisting court cases concerning immigration;</li><li>Resolving matters concerning citizenship and residential permit;</li><li>Assisting any person wishing to achieve, to finish application, or to move to Bayer for a residence permit or citizenship; and</li><li>Advising the Government for a suitable immigration policy.</li></ol>",
            "source": "No. 4 of 2022, Article 3",
            "note": "",
            "articleId": "5lL9r"
          }
        ]
      },
      {
        "chapter": "Residence Permit",
        "content": [
          {
            "article": "Eligibility for Application for Residence Permit",
            "content": "Any national of any foreign state to which the Bayer Free State has a diplomatic mission may apply for a residence permit to the Bayer Free State embassy in that state.",
            "source": "No. 4 of 2022, Article 4",
            "note": "",
            "articleId": "yyGkx"
          },
          {
            "article": "Residence Permit Procedures",
            "content": "A person applying for a residence permit shall be subjected to an interview with the Bayer ambassador responsible and any other immigration procedures. The ambassador shall report to the Immigration Board for consideration. If the Immigration Board approves by a majority vote, a residence permit shall be granted to the person, and they shall be allowed to enter the Bayer Free State without further procedures.",
            "source": "No. 4 of 2022, Article 5",
            "note": "",
            "articleId": "S384V"
          },
          {
            "article": "Residence Permit Rights and Protection",
            "content": "A person with a residence permit shall have the right to remain in the Bayer Free State and enjoy full protection, rights, and equality before Bayer laws except for the right to vote and to be qualified in elections, and be assisted and protected by the embassy of their state of origin in all legal proceedings, civil and criminal.",
            "source": "No. 4 of 2022, Article 6",
            "note": "",
            "articleId": "yK9ZS"
          },
          {
            "article": "Ascension to Citizenship and Change of Country of Origin",
            "content": "A person with a residence permit may choose to ascend to citizenship after appropriate procedures, after citizenship has been granted their residence permit shall be revoked, or to change their state of origin to which the Bayer Free State has a diplomatic mission according to their will.",
            "source": "No. 4 of 2022, Article 7",
            "note": "",
            "articleId": "Kl1n5"
          },
          {
            "article": "Suspension and Revocation of Residence Permit",
            "content": "A residence permit shall be suspended upon leaving the Bayer Free State, or be suspended or revoked by the Immigration Board with the permission of a court.",
            "source": "No. 4 of 2022, Article 8",
            "note": "",
            "articleId": "l0b5L"
          },
          {
            "article": "Juveniles Applying for Residence Permit",
            "content": "A juvenile under the age of 13 wishing to obtain a residence permit must be accompanied by a guardian who has attained the age of 13 and is a Bayer citizen.",
            "source": "No. 4 of 2022, Article 9",
            "note": "",
            "articleId": "rHL69"
          }
        ]
      },
      {
        "chapter": "Citizenship",
        "content": [
          {
            "article": "Eligibility for Application for Citizenship",
            "content": "Section 1\r\nAny person who is a national of any state to which the Bayer Free State has a diplomatic mission may apply for citizenship to the Bayer Free State embassy in that state. \r\nSection 2\r\nAny person who is sponsored by a citizen of the State may apply for citizenship to the Immigration Board. The number of persons that a Bayer citizen may sponsor over a period of time, and the total number of persons who may be granted citizenship over a period of time shall be determined by the Immigration Board.",
            "source": "No. 4 of 2022, Article 10",
            "note": "",
            "articleId": "FZpf6"
          },
          {
            "article": "Citizenship Procedures",
            "content": "Section 1\r\nA person applying for citizenship to a Bayer embassy shall be subjected to an interview with the Bayer ambassador responsible and any other immigration procedures. The ambassador shall report to the Immigration Board for consideration. If the Immigration Board approves by a majority vote, the person shall be subjected to an interview with the Immigration Board and any other immigration procedures. If the Immigration Board approves by a majority vote, citizenship shall be granted to the person, and they shall be allowed to enter the Bayer Free State without further procedures.\r\nSection 2\r\nA person applying for citizenship sponsored by a Bayer citizen shall be subjected to an interview with the Immigration Board and any other immigration procedures. If the Immigration Board approves by a majority vote, a temporary permit shall be granted to the person, and they shall be allowed to enter the Bayer Free State without further procedures. If no objection is offered by the Immigration Board on grounds prescribed in [BFSC], the person may request to be granted citizenship after at least seven contuniously days in the Bayer Free State with temporary permit.",
            "source": "No. 4 of 2022, Article 11",
            "note": "",
            "articleId": "p8VGg"
          },
          {
            "article": "Citizenship Rights and Protection",
            "content": "A person with citizenship shall have the right to remain in the Bayer Free State and enjoy full protection and equality before Bayer laws.",
            "source": "No. 4 of 2022, Article 12",
            "note": "",
            "articleId": "bNG7T"
          },
          {
            "article": "Temporary Permit Rights and Protection",
            "content": "A person holding a temporary permit shall have the right to remain in the Bayer Free State unless revoked, and shall enjoy full rights, protection, and privileges as those of citizenship, with the exception of the right to vote in any election and referendum, qualification as candidate for any public office, access to any governmental discussion channels, and qualification for resident status in Fidelissma.",
            "source": "No. 4 of 2022, Article 12.A",
            "note": "",
            "articleId": "R8vlB"
          },
          {
            "article": "Suspension and Revocation of Citizenship",
            "content": "Citizenship shall be suspended upon leaving the Bayer Free State, or be suspended or revoked by the Immigration Board with the permission of a court.",
            "source": "No. 4 of 2022, Article 13",
            "note": "",
            "articleId": "qCGx5"
          },
          {
            "article": "Suspension and Revocation of Temporary Permit",
            "content": "Section 1\r\nA temporary permit shall be revoked \r\nupon voluntarily leaving the Bayer Free State;\r\nby the Immigration Board for the commission of a criminal offense;\r\nby the Immigration Board for inability to naturalize with the community or the State; or\r\nif the temporary permit holder failed to apply for citizenship or renew temporary permit within 60 days from the day of issue of the temporary permit.\r\nSection 2\r\nA person whose temporary permit is revoked under Section 1 Clause b of this Article shall not be able to apply for a new temporary permit or citizenship within fourteen days since revocation; and for citizenship under Section 1 Clause c within three days.",
            "source": "No. 4 of 2022, Article 13.A",
            "note": "",
            "articleId": "HPyrP"
          },
          {
            "article": "Renewal of Temporary Permit",
            "content": "At any time when the temporary permit is still considered valid, a permit holder can apply for the renewal of their temporary permit. At the earliest opportunity, the Immigration Board shall revoke the permit, and if deemed appropriate, issue a new temporary permit in accordance with the standard procedure.",
            "source": "No. 4 of 2022, Article 13.B",
            "note": "",
            "articleId": "wwVtf"
          },
          {
            "article": "Juveniles Applying for Citizenship",
            "content": "A juvenile under the age of 13 wishing to obtain citizenship must be accompanied by a guardian who has attained the age of 13 and is a Bayer citizen.",
            "source": "No. 4 of 2022, Article 14",
            "note": "",
            "articleId": "ghDSv"
          },
          {
            "article": "Exemption for Former Citizens",
            "content": "A person who in the past has held citizenship which was suspended only due to voluntary leave shall be immediately granted citizenship upon joining the guild within 60 days after leaving. \r\nPart IV. Revocation and Temporary Suspension of Citizenship",
            "source": "No. 4 of 2022, Article 15",
            "note": "",
            "articleId": "gd6DC"
          },
          {
            "article": "Revocation of Residence Permit or Citizenship by a Court",
            "content": "With the permission of a court, the Immigration Board may revoke the residence permit or citizenship of a person for a determined period of time or indefinitely for grave crimes or other reasons. The said person shall be eligible to apply for a residence permit or citizenship after the aforementioned period.",
            "source": "No. 4 of 2022, Article 16",
            "note": "",
            "articleId": "4X7XK"
          },
          {
            "article": "Temporary Suspension of Residence Permit or Citizenship",
            "content": "With the permission of a court and sufficient evidence, the Immigration Board may temporarily suspend a residence permit or citizenship of a person suspected to be indefinitely or prolongedly inactive. The said person shall be immediately granted a residence permit or citizenship again after submitting a request to and being confirmed by the Immigration Board.",
            "source": "No. 4 of 2022, Article 17",
            "note": "",
            "articleId": "gD1dt"
          }
        ]
      },
      {
        "chapter": "Information Collection, Preservation, Distribution, and Usage",
        "content": [
          {
            "article": "Information Usage",
            "content": "Section 1\r\nWith consent from the applicant, information collected from offices of the Government, third-party, past applications, or via other means may be used to process applications, not limited to information collected from other partner states, past messages, or social media.\r\nSection 2\r\nInformation collected from any external source shall be noted down and provided to the applicant upon request. ",
            "source": "No. 4 of 2022, Article 18",
            "note": "",
            "articleId": "NB4V3"
          },
          {
            "article": "Information Preservation",
            "content": "Information that was collected shall be stored with acceptable security and limited access to personnel who are not directly involved in the process of application.",
            "source": "No. 4 of 2022, Article 19",
            "note": "",
            "articleId": "xMmVj"
          },
          {
            "article": "Information Distribution and Sharing",
            "content": "Section 1\r\nUpon request by an applicant, the Immigration Board must provide a copy of the applicant’s information.\r\nSection 2\r\nApplicant’s information may be distributed to other offices of the Government with the intent to ensure peace and order in Bayer Free State.\r\nSection 3\r\nWith consent from the applicant, anonymous information of applicants’ statistics may be shared for public data collection.\r\nSection 4\r\nWith reasonable grounds for the purpose of investigation, and with the approval from a court, an applicant’s information may be shared with a foreign state with which the Bayer Free State has diplomatic relations.",
            "source": "No. 4 of 2022, Article 20",
            "note": "",
            "articleId": "8Bybk"
          }
        ]
      }
    ]
  },
  {
    "title": "Copyright",
    "content": [
      {
        "chapter": "Governmental Intellectual Property",
        "content": [
          {
            "article": "Governmental Intellectual Property",
            "content": "Governmental intellectual property, known as GIP from this point onwards, shall include any legislation, court document, executive order, graphic design, anthem, flag, emblem, and any other national symbol created by or commissioned for the Government of the Bayer Free State.",
            "source": "No. 11 of 2022, Article 1",
            "note": "",
            "articleId": "1fY65"
          },
          {
            "article": "Rights to Governmental Intellectual Property",
            "content": "All rights regarding GIP shall be reserved to the Government of the Bayer Free State, with exceptions stated otherwise by this [Chapter], or by any other act enacted by the Parliament of the Bayer Free State.",
            "source": "No. 11 of 2022, Article 2",
            "note": "",
            "articleId": "WPwmM"
          },
          {
            "article": "Fair Use",
            "content": "The fair use of GIP, including such use by reproduction for purposes such as criticism, comment, expression, news reporting, teaching, scholarship, or research, shall be permitted without prior consent by the Government.",
            "source": "No. 11 of 2022, Article 3",
            "note": "",
            "articleId": "qJRLJ"
          },
          {
            "article": "GIP Copyright Infringement",
            "content": "An act including the use of, copying of, reproduction of, adapting of, or authoring or commissioning a work which bears resemblance, to a certain extent, to any GIP which is not protected by fair use without the prior consent of the Government of the Bayer Free State shall constitute a copyright infringement of GIP.",
            "source": "No. 11 of 2022, Article 4",
            "note": "",
            "articleId": "KrlCG"
          },
          {
            "article": "Consequences of GIP Copyright Infringement",
            "content": "Any person committing GIP copyright infringement may be tried in a civil trial, and if found liable shall have to compensate appropriately to the Government, and to take any other actions the court deems appropriate to be ordered.",
            "source": "No. 11 of 2022, Article 5",
            "note": "",
            "articleId": "Hskt5"
          },
          {
            "article": "Foreign States Committing GIP Copyright Infringement",
            "content": "The Head of State, the Prime Minister, and Parliament shall be authorized to confront, proceed in a civil trial in an appropriate national or international tribunal against, impose sanctions against, and sever diplomatic relationships with any foreign state committing GIP copyright infringement against the Government of the Bayer Free State as it deems appropriate.",
            "source": "No. 11 of 2022, Article 6",
            "note": "",
            "articleId": "SSYzC"
          }
        ]
      }
    ]
  },
  {
    "title": "Crimes and Criminal Procedures",
    "content": [
      {
        "chapter": "Crimes",
        "content": [
          {
            "part": "General Provisions",
            "content": [
              {
                "article": "Criminality and Punishability",
                "content": "Section 1\r\nThe criminality and punishability of an act shall be determined by the law in effect at the time of the commission of that act.\r\nSection 2\r\nWhen a law is changed after the commission of a crime, such act thereby no longer constitutes a crime under the new law, or the punishment therefore under the new law becomes less severe than under the previous law, the new law shall apply.\r\nSection 3\r\nWhen a law is changed after the sentence for a crime committed under the previous law has become final and such act thereby no longer constitutes a crime, the execution of the punishment shall be remitted.",
                "source": "No. 3 of 2022, Article 1",
                "note": "",
                "articleId": "Kk0pQ"
              },
              {
                "article": "Scope",
                "content": "Section 1\r\nThis [Chapter] shall apply to all persons committing crimes within the Bayer Free State.\r\nSection 2\r\nThis [Chapter] shall apply to any persons committing the following crimes in direct messages where at least one person residing in the Bayer Free State is present with at least one party giving consent to the State, and the State or any facility of the State was utilized to establish contact with that party, or any other use through which the crime was made possible.\r\nSection 3\r\nThis [Chapter] shall apply to any person remaining on Bayer embassy grounds outside of the Bayer Free State.\r\nSection 4\r\nThis [Chapter] shall apply to any person outside of the Bayer Free State that poses a significant threat to the safety and order of the State and its population, or during extraordinary circumstances in which the Bayer Free State has jurisdiction over.",
                "source": "No. 3 of 2022, Article 2",
                "note": "",
                "articleId": "w18VP"
              },
              {
                "article": "Application of General Provisions",
                "content": "[Part 1 of this Chapter] shall apply to other Acts providing statutes concerning crimes, unless stated otherwise by such Acts.",
                "source": "No. 3 of 2022, Article 3",
                "note": "",
                "articleId": "rWhbL"
              },
              {
                "article": "Mitigation of Punishment for Juveniles",
                "content": "Punishments for a person classified as a juvenile may be mitigated when considered proper by the court.",
                "source": "No. 3 of 2022, Article 4",
                "note": "",
                "articleId": "T6XQn"
              },
              {
                "article": "Punishment of Alternative Accounts",
                "content": "Punishments imposed on both the main shall be imposed on alternative accounts of a person committing crimes.",
                "source": "No. 3 of 2022, Article 5",
                "note": "",
                "articleId": "sYn8Y"
              },
              {
                "article": "Preventive Acts",
                "content": "Section 1 \r\nAn act which is performed in order to prevent impending and unjust infringement of one’s own or another person’s legal interest shall not be punishable if there are reasonable grounds for that act.\r\nSection 2 \r\nWhen a preventive act has exceeded normal limits, the punishment may be mitigated or remitted according to the extenuating circumstances.\r\nSection 3\r\nIn the case of the preceding section, an act performed through fear, surprise, excitement, or confusion in the night or under other extraordinary circumstances shall not be punishable.",
                "source": "No. 3 of 2022, Article 6",
                "note": "",
                "articleId": "VvKN9"
              },
              {
                "article": "Attempted Crimes",
                "content": "Section 1\r\nWhen an intended crime is not completed or if the intended result does not occur, it shall be punishable as an attempted crime.\r\nSection 2\r\nWhen a conspiracy or the preparatory action for a crime has not reached the commencement stage for the commission of the crime, it shall be punishable as a conspiracy to commit such crime.\r\nSection 3\r\nWhen a person is convicted of a crime for which that person has previously been convicted, that person shall be punished as a habitual offender.\r\nSection 4\r\nA person committing attempted crimes and conspiracy to commit crimes shall be punished as provided in the Articles providing for the intended crimes. Punishments in this case may be mitigated or remitted.\r\nSection 5\r\nPunishments for a habitual offender may be increased depending on the severity and the frequency of the crimes.",
                "source": "No. 3 of 2022, Article 7",
                "note": "",
                "articleId": "9PWNS"
              },
              {
                "article": "Instigation of Crimes",
                "content": "For a person who instigates another to commit a crime, the same punishment shall be applied to the instigator as one who actually commits the crime.",
                "source": "No. 3 of 2022, Article 8",
                "note": "",
                "articleId": "zKvlg"
              },
              {
                "article": "Punishment",
                "content": "Section 1\r\nOne, multiple, or all of the following may be legally used by the State as punishments for offenders of this [Chapter]:\r\n<ol class=\"clause\"><li>Warning: A written warning may be issued and shall expire after 30 days since the issuing date.\r\n2. Mute: A guilty person may be deprived of the right to talk in the Bayer Free State for no more than 30 days.\r\n3. Kick: A guilty person may be forcibly removed from the Bayer Free State or any of its possession.\r\n4. Ban: A guilty person may be forcibly removed from, and denied entry into the Bayer Free State or any of its possession for not for more than 180 days.\r\n5. Refusal of entry: A guilty person outside of the Bayer Free State may be denied entry into the Bayer Free State or any of its possession for no more than 180 days.\r\n6. Deprivation of qualifications: A guilty person may be deprived of the right to become an officer holding public offices of the Bayer Free State for no more than 1 year.\r\n7. Suspension of qualifications: A guilty person holding public offices may be forcibly removed from such offices.\r\nSection 2\r\nThe citizenship of a person shall be revoked if that person is banned from or denied entry into the Bayer Free State.\r\nSection 3\r\nA guilty person shall be derived of qualifications to hold public offices of the Bayer Free State as defined in Section 1 Clause (f) of this Article if any punishment provided by Article 9, Section 1, Clauses from (a) to (e) is applied to that person, and the duration of the deprivation shall be equal to the term of the applied punishments.\r\nSection 4\r\nPunishments for a guilty person outside of the Bayer Free State shall be changed to refusal of entry as described by Section 1 Clause (e) of this Article.\r\nSection 5\r\nWhenever deemed proper and necessary by the court, upon the request of the Government, a person sentenced to ban or refusal of entry, at the end of their sentence, may be additionally sentenced for a period of no more than 90 days for as many times as the court deems necessary.\r\nSection 6\r\nA sentence imposed on a person by a court may be suspended in return for certain conditions and restrictions imposed, and that sentence shall be applied if the conditions and restrictions imposed are violated.",
                "source": "No. 3 of 2022, Article 9",
                "note": "",
                "articleId": "djKx5"
              },
              {
                "article": "Determination of Punishment",
                "content": "In determining punishment, the following shall be taken into consideration:\r\n<ol class=\"clause\"><li>The age, character, conduct, and intelligence of the offender;</li><li>Offender’s relation to the victim;</li><li>The motive for the commission of the crime, the means and the result; and</li><li>Circumstances after the commission of the crime.</li></ol>",
                "source": "No. 3 of 2022, Article 10",
                "note": "",
                "articleId": "5XJ48"
              },
              {
                "article": "Mitigation or Remission of a Sentence for Cooperation",
                "content": "When voluntary confession is made which aids the investigation of the crime, the punishment may be mitigated or remitted.",
                "source": "No. 3 of 2022, Article 11",
                "note": "",
                "articleId": "JThxR"
              }
            ]
          },
          {
            "part": "Privacy and Harassment",
            "content": [
              {
                "article": "Harassment",
                "content": "Section 1\r\nA person shall be guilty of harassment if that person publishes, displays, or issues abusive or threatening speech, writing, or other forms of media that expresses or encourages prejudice, insult, violence, suicide, or hatred against a particular individual; emphasizes on facts or truths that may cause distress to an individual; or builds up the context of a conversation in a way that may cause discomfort towards an individual.\r\nSection 2\r\nHarassment may be committed against an individual on the basis of sex, gender identity, sexual orientation, race, colour, language, religion, political or other opinion, national or social origin, association with a national minority, property, birth, physical or mental ability, or other status.\r\nSection 3\r\nA person shall not be guilty of harassment if the content communicated was not intended to cause harm to any individuals.\r\nSection 4\r\nA person guilty of harassment shall be issued a warning, kicked, muted, or banned from the State.",
                "source": "No. 3 of 2022, Article 12",
                "note": "",
                "articleId": "HcXDb"
              },
              {
                "article": "Infringement of Privacy",
                "content": "Section 1\r\nA person shall be guilty of infringement of privacy if that person:\r\n<ol class=\"clause\"><li>intrudes, physically, electronically, or otherwise, upon the private space, solitude, or seclusion of a person, or the private affairs or concerns of a person, by use of the perpetrator’s physical senses or by electronic device or devices to oversee or overhear the person’s private affairs, or by some other form of investigation, examination, or observation intrude upon a person’s private matters if the intrusion would be highly offensive to a reasonable person;</li><li>2. publishes or widely disseminates little-known, private facts that are non-newsworthy, not part of public records, public proceedings, not of public interest, and would be offensive to a reasonable person if made public; or</li><li>publishes false information about an individual with the intent of causing harm to or creating false public perception of that individual.</li></ol>\r\nSection 2\r\nActs which constitute infringement of privacy may include, but not limited to:\r\n<ol class=\"clause\"><li>publishing an individual’s private phone number, email address, IP address, password or other contact information without prior consent;</li><li>publishing an individual’s real name or face without prior consent;</li><li>obtaining private information without an individual’s consent or knowledge; or</li><li>publishing an individual’s private messages or other communication without prior consent.</li></ol>\r\nSection 3\r\nA person shall not be guilty of infringement of privacy if that person discloses to law enforcement or a court of law an individual’s private information that, with plausible reasons, is believed to be of important use for the investigation of a possible crime.\r\nSection 4\r\nA person guilty of infringement of privacy shall be issued a warning, kicked, muted, or banned from the State.",
                "source": "No. 3 of 2022, Article 13",
                "note": "",
                "articleId": "ktBS5"
              },
              {
                "article": "Impersonation",
                "content": "Section 1\r\nA person shall be guilty of impersonation if that person pretends to be a different individual or a group of individuals by creating a new account or by altering an existing account for the purpose of committing fraudulent or malicious acts.\r\nSection 2\r\nA person shall be guilty of impersonation of a public official if that person impersonates an individual who holds offices of the Bayer Free State. Additional punishments for impersonation of a public official shall be applied.\r\nSection 3\r\nA person shall be guilty of impersonation for evading enforcement or evading prosecution if that person pretends to be a different individual to evade legislation, court orders, or punishments, or to hinder the prosecution of that individual or any other individual.\r\nSection 4\r\nA person guilty of impersonation shall be issued a warning, kicked, muted, or banned from the State.\r\nSection 5\r\nIf an alternative account is used in commissioning the crime of impersonation, that account shall be banned indefinitely.",
                "source": "No. 3 of 2022, Article 14",
                "note": "",
                "articleId": "BZyLl"
              },
              {
                "article": "Sexual Harassment",
                "content": "Section 1\r\nA person shall be guilty of sexual harassment if that person makes an unwanted or unwelcome sexual advance or request for sexual favors which is offensive, humiliating, or intimidating towards an individual; or communicating unwanted or unwelcome obscene and pornographic materials to an individual without consent.\r\nSection 2\r\nA person committing sexual harassment towards a juvenile shall be guilty of child sexual harassment.\r\nSection 3\r\nA person guilty of sexual harassment shall be kicked, muted, or banned from the State.\r\nSection 4\r\nAdditional punishments for child sexual harassment shall be applied.",
                "source": "No. 3 of 2022, Article 23",
                "note": "",
                "articleId": "wPkzc"
              }
            ]
          },
          {
            "part": "Disturbance of the Peace",
            "content": [
              {
                "article": "Spamming",
                "content": "Section 1\r\nA person shall be guilty of spamming when that person indiscriminately and unreasonably sends the same or nearly the same message multiple times within a short period of time with the intention of causing annoyance, disruption, unnecessary attention, or inconvenience without reasonable cause.\r\nSection 2\r\nA person shall not be guilty of spamming if the act is conducted in a channel designated for spamming.\r\nSection 3\r\nA person guilty of spamming shall be issued a warning, or muted for not more than 15 days.",
                "source": "No. 3 of 2022, Article 15",
                "note": "",
                "articleId": "bMZWc"
              },
              {
                "article": "Unnecessary Ping",
                "content": "Section 1\r\nA person shall be guilty of unnecessary ping when that person mentions an individual, a group of individuals, a role, everyone, or here, with the intention of causing annoyance, disruption, unnecessary attention, or inconvenience without reasonable cause.\r\nSection 2\r\nA person shall not be guilty of unnecessary ping if the act is proven to be accidental.\r\nSection 3\r\nA person guilty of unnecessary ping shall be issued a warning, or muted for not more than 15 days.",
                "source": "No. 3 of 2022, Article 16",
                "note": "",
                "articleId": "37gFc"
              },
              {
                "article": "Obscenity",
                "content": "Section 1\r\nAll obscene content, which includes content which contains nudity, intense sexuality, extreme violence, or other potentially disturbing subject matter, in any formats shall be prohibited from knowingly being posted in all channels except the designated channels for obscene content.\r\nSection 2\r\nAccidental posting of obscene content shall be exempt from prosecution.\r\nSection 3\r\nThe posting of obscene content for non-inappropriate purposes shall be allowed, in which case the obscene content must be marked as spoiler or a warning must be posted beforehand.\r\nSection 4\r\nContent containing inappropriate language which does not imply the aforementioned subject matter shall be excluded.\r\nSection 5\r\nA person guilty of posting obscene content shall be issued a warning, kicked, or banned for no more than 120 days from the State, or for no more than 180 days if the crime was committed against a juvenile.",
                "source": "No. 3 of 2022, Article 17",
                "note": "",
                "articleId": "0qqs8"
              },
              {
                "article": "Raiding",
                "content": "Section 1\r\nA person shall be guilty of raiding if that person incites, assists, organizes, or engages in committing an unlawful act with a group of individuals with the intention of causing annoyance, disruption, unnecessary attention, or inconvenience.\r\nSection 2\r\nA person guilty of raiding shall be kicked, muted, or banned from the State.",
                "source": "No. 3 of 2022, Article 21",
                "note": "",
                "articleId": "PWl9R"
              }
            ]
          },
          {
            "part": "Fraud",
            "content": [
              {
                "article": "Fraud",
                "content": "Section 1\r\nA person shall be guilty of fraud if that person knowingly and deliberately commences deception with the intention of securing unfair or unlawful gain, or depriving a victim of a legal right.\r\nSection 2\r\nA person guilty of fraud shall be issued a warning, kicked, muted, or banned from the State.",
                "source": "No. 3 of 2022, Article 22",
                "note": "",
                "articleId": "bG33b"
              }
            ]
          },
          {
            "part": "Threats to the State",
            "content": [
              {
                "article": "Treason",
                "content": "Section 1\r\nA person bearing Bayer Free State citizenship shall be guilty of treason if that person wages an act of aggression against the Bayer Free State, or collaborates with the enemies of the Bayer Free State within the State or somewhere else.\r\nSection 2\r\nA person guilty of treason shall be kicked, or banned from the State.",
                "source": "No. 3 of 2022, Article 18",
                "note": "",
                "articleId": "TYBjB"
              },
              {
                "article": "Insurrection",
                "content": "Section 1\r\nA person shall be guilty of insurrection if that person incites, assists, or engages in any rebellion against the authority of the Bayer Free State, its Constitution, or its laws.\r\nSection 2\r\nA person guilty of insurrection shall be kicked, muted, or banned from the State.",
                "source": "No. 3 of 2022, Article 19",
                "note": "",
                "articleId": "GNMFY"
              }
            ]
          },
          {
            "part": "Crimes in Official Capacity",
            "content": [
              {
                "article": "Abuse of Power",
                "content": "Section 1\r\nA person holding public offices of the Bayer Free State shall be guilty of abuse of power if that person commits an unlawful act using the power vested in such offices.\r\nSection 2\r\nA person guilty of abuse of power shall be suspended of qualifications, or deprived of qualifications.",
                "source": "No. 3 of 2022, Article 20",
                "note": "",
                "articleId": "pr8cV"
              },
              {
                "article": "Disruption and Abuse",
                "content": "Section 1\r\nA person shall be guilty of taking a disruptive or abusive administrative action if that person knowingly:\r\n<ol class=\"clause\"><li>without good cause, takes any administrative action which is disruptive or demonstrates clear abuse of power for unlawful gains;</li><li>without probable cause, takes any administrative action without the proper process or authorization under this [Chapter]; or</li><li>obstructs or interferes with the access of any authorized person to the audit log or their review of the audit log.</li></ol>\r\nSection 2\r\nA person guilty of taking a disruptive or abusive administrative action shall be issued a warning, kicked, banned, deprived or suspended of qualifications. ",
                "source": "No. 13 of 2022, Article 34",
                "note": "",
                "articleId": "tLQ1L"
              }
            ]
          },
          {
            "part": "Election Criminal Offenses",
            "content": [
              {
                "article": "Intimidation or Coercion towards a Voter",
                "content": "Section 1\r\n​​A person shall be guilty of intimidation or coercion towards a voter if that person intimidates, threatens, coerces, or attempts to intimidate, threaten, or coerce, any other person for the purpose of interfering with the right of such other person to vote or to vote as they may choose, or of causing such other person to vote for, or not to vote for, any candidate for any office which requires elections by law, at any election held solely or in part for the purpose of electing such candidate; or to vote for, or not to vote for any option of a public referendum.\r\nSection 2\r\nAny person guilty of intimidation or coercion towards a voter shall be issued a warning, muted, kicked, or banned for no more than 120 days.",
                "source": "No. 7 of 2022, Article 42",
                "note": "",
                "articleId": "DJDzK"
              },
              {
                "article": "Intimidation or Coercion towards the Election Commission",
                "content": "Section 1\r\n​​A person shall be guilty of intimidation or coercion towards a Member of the Election Commission if that person intimidates, threatens, coerces, or attempts to intimidate, threaten, or coerce, any other person for the purpose of interfering with the functions and duties of the Election Commission.\r\nSection 2\r\nAny person guilty of intimidation or coercion towards the Election Commission shall be issued a warning, muted, or banned.",
                "source": "No. 7 of 2022, Article 43",
                "note": "",
                "articleId": "YzCdy"
              },
              {
                "article": "Alteration of Vote Record or Instrument",
                "content": "Section 1\r\nA person shall be guilty of alteration of vote record or instrument if that person is a Member of the Election Commission and knowingly and unlawfully alters the vote or ballot record of an election or voting instrument.\r\nSection 2\r\nAny person guilty of alteration of vote record or instrument shall be muted, or banned.",
                "source": "No. 7 of 2022, Article 44",
                "note": "",
                "articleId": "YBgWn"
              },
              {
                "article": "Voter Fraud",
                "content": "Section 1\r\nA person shall be guilty of voter fraud if that person\r\n<ol class=\"clause\"><li>votes under an alternate identity in an election;</li><li>votes while lacking qualifications to vote in an election;</li><li>submits multiple ballots in the same election; or</li><li>buys, sells, or accepts payment or other favors for votes in an election.\r\nSection 2\r\nAny person guilty of voter fraud shall be issued a warning, muted, kicked, or banned.",
                "source": "No. 7 of 2022, Article 45",
                "note": "",
                "articleId": "p1rFl"
              }
            ]
          },
          {
            "part": "Obstruction of Justice",
            "content": [
              {
                "article": "Hindering Investigation or Prosecution",
                "content": "Section 1\r\nA person shall be guilty of hindering investigation or prosecution of another person or themself if that person knowingly:\r\n<ol class=\"clause\"><li>Harbors or concealing the other person;</li><li>Warns the other person of impending discovery, apprehension, prosecution, or conviction. This does not apply to a warning given in connection with an effort to bring another into compliance with the law;</li><li>Provides the other person with money, transportation, a weapon, a disguise, or other similar means of avoiding discovery, apprehension, prosecution, or conviction;</li><li>Prevents or obstructs by means of force, deception, or intimidation anyone from performing an act that might aid in the discovery, apprehension, prosecution, or conviction of the other person;</li><li>Suppresses by an act of concealment, alteration, or destruction any physical evidence that might aid in the discovery, apprehension, prosecution, or conviction of the other person; or</li><li>Conceals the identity of the other person.</li></ol>\r\nSection 2\r\nA person guilty of hindering investigation or prosecution shall be kicked, muted, or banned from the State.",
                "source": "No. 3 of 2022, Article 24",
                "note": "",
                "articleId": "Z7fHX"
              },
              {
                "article": "Violation of Court Order",
                "content": "Section 1\r\nA person shall be guilty of violating a court order if that person knowingly disobeys or disregards a court order issued by a court.\r\nSection 2\r\nA person guilty of violating a court order shall be kicked, muted, or banned from the State.",
                "source": "No. 3 of 2022, Article 25",
                "note": "",
                "articleId": "PYVf8"
              },
              {
                "article": "Court Tampering",
                "content": "Section 1\r\nA person shall be guilty of court tampering if that person knowingly and maliciously influences the composition and/or decisions of a jury or a court during the course of a trial.\r\nSection 2\r\nA person guilty of court tampering shall be kicked, muted, or banned from the State.",
                "source": "No. 3 of 2022, Article 26",
                "note": "",
                "articleId": "zdDT1"
              }
            ]
          }
        ]
      },
      {
        "chapter": "Criminal Procedures",
        "content": [
          {
            "part": "Applicability",
            "content": [
              {
                "article": "Scope; Definitions",
                "content": "Section 1\r\nThis [Chapter] shall govern the procedure in all criminal proceedings in the Court of Justice of the Bayer Free State, and all subsequent courts that may be established by law within the jurisdiction of the Bayer Free State.\r\nSection 2\r\nFor the purpose of this [Chapter]:",
                "source": "* “Attorney for the Government” means the Head of State, the Prime Minister, or any person authorized by law to enforce criminal laws.",
                "note": "",
                "articleId": "6X1mK"
              },
              {
                "article": "Interpretation",
                "content": "This [Chapter] is to be interpreted to provide for the just determination of every criminal proceeding, to secure simplicity in procedure and fairness in administration, and to eliminate unjustifiable expense and delay.",
                "source": "No. 6 of 2022, Article 2",
                "note": "",
                "articleId": "V33rZ"
              }
            ]
          },
          {
            "part": "Preliminary Proceedings",
            "content": [
              {
                "article": "The Complaint",
                "content": "The complaint is a written statement of the essential facts constituting the offense charged.",
                "source": "No. 6 of 2022, Article 3",
                "note": "",
                "articleId": "s6GYZ"
              },
              {
                "article": "Warrant on a complaint, warrant for an emergency",
                "content": "Section 1\r\nIf the complaint establishes probable cause to believe that an offense has been committed, that the defendant committed it, and that the defendant may continue the commission of that offense, or may commit another offense, the judge must issue a warrant to a person authorized to execute it to take appropriate measures against the defendant. At the request of an attorney for the government, the judge must issue a warrant to a person authorized to serve it. A judge may issue more than one warrant or summons on the same complaint. \r\nSection 2\r\nA warrant must:",
                "source": "* contain the defendant’s name, or, if it is unknown, a name or description by which the defendant can be identified with reasonable certainty;",
                "note": "",
                "articleId": "ftV3c"
              },
              {
                "article": "Announcement of Proceedings",
                "content": "As soon as an arrangement for proceedings is achieved, an announcement by the judge must be made to the public as soon as possible.",
                "source": "No. 6 of 2022, Article 5",
                "note": "",
                "articleId": "CL3J5"
              }
            ]
          },
          {
            "part": "The Indictment, the Information, and the Grand Jury",
            "content": [
              {
                "article": "The Grand Jury",
                "content": "Section 1\r\n<ol class=\"clause\"><li>The court must order that a grand jury be summoned for every trial. A grand jury must have 3 to 20 members, and the court must order that enough legally qualified persons be summoned to meet this requirement, unless provided otherwise by statutes.</li><li>When a grand jury is selected, the court may also select alternate jurors. Alternate jurors must have the same qualifications and be selected in the same manner as any other juror. Alternate jurors replace jurors in the same sequence in which the alternates were selected. An alternate juror who replaces a juror is subject to the same challenges, takes the same oath, and has the same authority as the other jurors.</li></ol>Section 2\r\n<ol class=\"clause\"><li>Either the government or a defendant may challenge the grand jury anonymously on the ground that it was not lawfully drawn, summoned, or selected, and may challenge an individual juror on the ground that the juror is not legally qualified.</li><li>A party may move to dismiss the indictment based on an objection to the grand jury or on an individual juror's lack of legal qualification, unless the court has previously ruled on the same objection under Article 6, Section 2, Clause a). The court must not dismiss the indictment on the ground that a grand juror was not legally qualified if the record shows that at least 2 qualified jurors concurred in the indictment.</li></ol>\r\nSection 3\r\nThe court will appoint one juror as the foreperson. The foreperson may administer oaths and affirmations and will sign all indictments. The foreperson—or another juror designated by the foreperson—will record the number of jurors concurring in every indictment and will file the record with the court, but the record may not be made public unless the court so orders.\r\nSection 4\r\n<ol class=\"clause\"><li>The following persons may be present while the grand jury is in session: attorneys for the government, the witness being questioned, interpreters when needed, and a court reporter or an operator of a recording device.</li><li>No person other than the jurors and the judge may be present while the grand jury is deliberating or voting.</li></ol>\r\nSection 5\r\n<ol class=\"clause\"><li>Except while the grand jury is deliberating or voting, all proceedings must be recorded by a court reporter or by a suitable recording device. But the validity of a prosecution is not affected by the unintentional failure to make a recording. Unless the court orders otherwise, an attorney for the government will retain control of the recording, the reporter's notes, and any transcript prepared from those notes.</li><li>Subject to any right to an open hearing in a contempt proceeding, the court must close any hearing to the extent necessary to prevent disclosure of a matter occurring before a grand jury.</li><li>Records, orders, and subpoenas relating to grand-jury proceedings must be kept under seal to the extent and as long as necessary to prevent the unauthorized disclosure of a matter occurring before a grand jury.</li><li>A knowing violation of [this Article] may be punished as a contempt of court.</li></ol>\r\nSection 6\r\nA grand jury may indict only if at least 2 jurors concur. The grand jury—or its foreperson—must return the indictment to a judge in open court. If a complaint or information is pending against the defendant and 3 jurors do not concur in the indictment, the foreperson must promptly and in writing report the lack of concurrence to the judge.\r\nSection 7\r\nA grand jury must serve until the court discharges it, but it may serve more if the court, having determined that an extension is in the public interest, extends the grand jury's service. An extension may be granted for no more than 6 days, except as otherwise provided by statute.\r\nSection 8\r\nAt any time, for good cause, the court may excuse a juror either temporarily or permanently, and if permanently, the court may impanel an alternate juror in place of the excused juror.",
                "source": "No. 6 of 2022, Article 6",
                "note": "",
                "articleId": "JzHhm"
              },
              {
                "article": "The Indictment and the Information",
                "content": "Section 1\r\n<ol class=\"clause\"><li>An offense (other than criminal contempt) must be prosecuted by an indictment if it is punishable by a temporary ban for more than fifteen days.</li><li>An offense punishable by a temporary ban for fifteen days or less may be prosecuted in accordance with [BFSC].</li>></ol>\r\nSection 2\r\nAn offense punishable by a temporary ban for more than fifteen days may be prosecuted by information if the defendant—in open court and after being advised of the nature of the charge and of the defendant's rights—waives prosecution by indictment.\r\nSection 3\r\n<ol class=\"clause\"><li>The indictment or information must be a plain, concise, and definite written statement of the essential facts constituting the offense charged and must be signed by an attorney for the government. It need not contain a formal introduction or conclusion. A count may incorporate by reference an allegation made in another count. A count may allege that the means by which the defendant committed the offense are unknown or that the defendant committed it by one or more specified means. For each count, the indictment or information must give the official or customary citation of the statute, rule, regulation, or other provision of law that the defendant is alleged to have violated.</li><li>Unless the defendant was misled and thereby prejudiced, neither an error in a citation nor a citation's omission is a ground to dismiss the indictment or information or to reverse a conviction.</li></ol>\r\nSection 4\r\nUpon the defendant's motion, the court may strike surplusage from the indictment or information.\r\nSection 5\r\nUnless an additional or different offense is charged or a substantial right of the defendant is prejudiced, the court may permit an information to be amended at any time before the verdict or finding.",
                "source": "No. 6 of 2022, Article 7",
                "note": "",
                "articleId": "rx8nQ"
              },
              {
                "article": "Joinder of Offenses or Defendants",
                "content": "Section 1\r\nThe indictment or information may charge a defendant in separate counts with 2 or more offenses if the offenses charged are of the same or similar character, or are based on the same act or transaction, or are connected with or constitute parts of a common scheme or plan.\r\nSection 2\r\nThe indictment or information may charge 2 or more defendants if they are alleged to have participated in the same act or transaction, or in the same series of acts or transactions, constituting an offense or offenses. The defendants may be charged in one or more counts together or separately. All defendants need not be charged in each count.",
                "source": "No. 6 of 2022, Article 8",
                "note": "",
                "articleId": "BbMZ6"
              },
              {
                "article": "Warrant on an Indictment or Information",
                "content": "Warrant on an indictment or information shall be issued and executed as governed in [8 BFSC 30].",
                "source": "No. 6 of 2022, Article 9",
                "note": "",
                "articleId": "lBSmR"
              }
            ]
          },
          {
            "part": "Preparations for Trial",
            "content": [
              {
                "article": "Pretrial Motions",
                "content": "Section 1\r\n<ol class=\"clause\"><li>A party may raise by pretrial motion any defense, objection, or request that the court can determine without a trial on the merits. Article 41 applies to a pretrial motion.</li><li>A motion that the court lacks jurisdiction may be made at any time while the case is pending.</li><li>The following defenses, objections, and requests must be raised by pretrial motion if the basis for the motion is then reasonably available and the motion can be determined without a trial on the merits:<ul><li>a motion alleging a defect in instituting the prosecution, including:<ul><li>improper venue;</li><li>pre-indictment delay;</li><li>selective or vindictive prosecution; and</li><li>an error in the grand-jury proceeding or preliminary hearing;</li></ul></li> <li>a defect in the indictment or information; including:<ul><li>joining two or more offenses in the same count (duplicity);</li><li>charging the same offense in more than one count (multiplicity);</li><li>lack of specificity;</li><li>improper joinder; and</li><li>failure to state an offense;</li></ul></li><li>suppression of evidence; and</li><li>severance of charges or defendants under [BFSC].</li></ul><li>As soon as practicable, the government may notify the defendant of its intent to use specified evidence at trial in order to afford the defendant an opportunity to object before trial under [this Artcle], Section 1, Clause c), Item 3.</li></ol>\r\nSection 2\r\n<ol class=\"clause\"><li>The court may, as soon as practicable, set a deadline for the parties to make pretrial motions and may also schedule a motion hearing. If the court does not set one, the deadline is the start of the trial.</li><li>At any time before trial, the court may extend or reset the deadline for pretrial motions.</li><li>If a party does not meet the deadline for making an [this Artcle], Section 1, Clause c) motion, the motion is untimely. But a court may consider the defense, objection, or request if the party shows good cause.</li></ol>\r\nSection 3\r\nThe court must decide every pretrial motion before trial unless it finds good cause to defer a ruling. The court must not defer ruling on a pretrial motion if the deferral will adversely affect a party's right to appeal. When factual issues are involved in deciding a motion, the court must state its essential findings on the record.\r\nSection 4\r\nAll proceedings at a motion hearing, including any findings of fact and conclusions of law made by the court, must be recorded by a court reporter or a suitable recording device.",
                "source": "No. 6 of 2022, Article 10",
                "note": "",
                "articleId": "qb8ZF"
              },
              {
                "article": "Joint Trial of Separate Cases",
                "content": "The court may order that separate cases be tried together as though brought in a single indictment or information if all offenses and all defendants could have been joined in a single indictment or information.",
                "source": "No. 6 of 2022, Article 11",
                "note": "",
                "articleId": "S6MW7"
              },
              {
                "article": "Relief from Prejudicial Joinder",
                "content": "If the joinder of offenses or defendants in an indictment, or an information appears to prejudice a defendant or the government, the court may order separate trials of counts, sever the defendants’ trials, or provide any other relief that justice requires.",
                "source": "No. 6 of 2022, Article 12",
                "note": "",
                "articleId": "wXVGB"
              },
              {
                "article": "Depositions",
                "content": "Section 1\r\nA party may move that a prospective witness be deposed in order to preserve testimony for trial. The court may grant the motion because of exceptional circumstances and in the interest of justice. If the court orders the deposition to be taken, it may also require the deponent to produce at the deposition any designated material that is not privileged, including any book, paper, document, record, recording, or data.\r\nSection 2\r\nA party seeking to take a deposition must give every other party reasonable written notice of the deposition.\r\nSection 3\r\nUnless this article or a court order provides otherwise, a deposition must be taken and filed in the same manner as a deposition in a civil action, except that:\r\n<ol class=\"clause\"><li>A defendant may not be deposed without that defendant's consent.</li><li>The scope and manner of the deposition examination and cross-examination must be the same as would be allowed during trial.</li><li>The government must provide to the defendant or the defendant's attorney, for use at the deposition, any statement of the deponent in the government's possession to which the defendant would be entitled at trial.</li></ol>\r\nSection 4\r\nAn order authorizing a deposition to be taken under this article does not determine its admissibility. A party may use all or part of a deposition as provided by the Evidence Act.\r\nSection 5\r\nA party objecting to deposition testimony or evidence must state the grounds for the objection during the deposition.\r\nSection 6\r\nThe parties may by agreement take and use a deposition with the court's consent.",
                "source": "No. 6 of 2022, Article 14",
                "note": "",
                "articleId": "xW0KJ"
              },
              {
                "article": "Disclosure of Evidence",
                "content": "Section 1\r\n<ol class=\"clause\"><li>Information subject to disclosure:<ul><li>Defendant's Oral Statement. Upon a defendant's request, the government must disclose to the defendant the substance of any relevant oral statement made by the defendant, before or after arrest, in response to interrogation by a person the defendant knew was a government agent if the government intends to use the statement at trial.</li><li>Defendant's Written or Recorded Statement. Upon a defendant's request, the government must disclose to the defendant, and make available for inspection, copying, or photographing, all of the following:<ul><li>any relevant written or recorded statement by the defendant if:<ul><li>statement is within the government's possession, custody, or control; and</li><li>the attorney for the government knows—or through due diligence could know—that the statement exists;</li></ul></li><li>the portion of any written record containing the substance of any relevant oral statement made before or after arrest if the defendant made the statement in response to interrogation by a person the defendant knew was a government agent; and</li><li>the defendant's recorded testimony before a grand jury relating to the charged offense.</li></ul></li><li>Defendant's Prior Record. Upon a defendant's request, the government must furnish the defendant with a copy of the defendant's prior criminal record that is within the government's possession, custody, or control if the attorney for the government knows—or through due diligence could know—that the record exists.</li><li>Documents and Objects. Upon a defendant's request, the government must permit the defendant to inspect and to copy or photograph books, papers, documents, data, photographs, tangible objects, buildings or places, or copies or portions of any of these items, if the item is within the government's possession, custody, or control and:<ul><li>the item is material to preparing the defense;</li><li>the government intends to use the item in its case-in-chief at trial; or</li><li>the item was obtained from or belongs to the defendant.</li></ul></li><li>Examination and Tests. Upon a defendant's request, the government must permit a defendant to inspect and to copy or photograph the results or reports of any physical or mental examination and of any scientific test or experiment if:<ul><li>the item is within the government's possession, custody, or control;</li><li>the attorney for the government knows—or through due diligence could know—that the item exists; and</li><li>the item is material to prepare the defense or the government intends to use the item in its case-in-chief at trial.</li></ul></li></ul></li><li>Except as permitted by [this Article] Section 1 Clause a except Item 4, this article does not authorize the discovery or inspection of reports, memoranda, or other internal government documents made by an attorney for the government or other government agent in connection with investigating or prosecuting the case. Nor does this article authorize the discovery or inspection of statements made by prospective government witnesses.</li><li>This article does not apply to the discovery or inspection of a grand jury's recorded proceedings, except as provided in [BFSC], [BFSC], [BFSC], and [BFSC].</li></ol>\r\nSection 2\r\n<ol class=\"clause\"><li>Information Subject to Disclosure:<ul><li>Documents and Objects. If a defendant requests disclosure under [this Article] Section 1 Clause a Item 4 and the government complies, then the defendant must permit the government, upon request, to inspect and to copy or photograph books, papers, documents, data, photographs, tangible objects, buildings or places, or copies or portions of any of these items if:<ul><li>the item is within the defendant's possession, custody, or control; and</li><li>the defendant intends to use the item in the defendant's case-in-chief at trial.</li></ul></li><li>Reports of Examinations and Tests. If a defendant requests disclosure under [this Article] Section 1 Clause a Item 5 and the government complies, the defendant must permit the government, upon request, to inspect and to copy or photograph the results or reports of any physical or mental examination and of any scientific test or experiment if:<ul><li>the item is within the defendant's possession, custody, or control; and</li><li>the defendant intends to use the item in the defendant's case-in-chief at trial, or intends to call the witness who prepared the report and the report relates to the witness's testimony.</li></ul></li></ul></li><li>Except for scientific or medical reports, [this Article] Section 2 Clause a does not authorize discovery or inspection of:<ul><li>reports, memoranda, or other documents made by the defendant, or the defendant's attorney or agent, during the case's investigation or defense; or</li><li>a statement made to the defendant, or the defendant's attorney or agent, by:<ul><li>the defendant;</li><li>a government or defense witness; or</li><li>a prospective government or defense witness.</li></ul></li></ul></li></ol>\r\nSection 3\r\nA party who discovers additional evidence or material before or during trial must promptly disclose its existence to the other party or the court if:<ol class=\"clause\"><li>the evidence or material is subject to discovery or inspection under this article; and</li><li>the other party previously requested, or the court ordered, its production.</li></ol>\r\nSection 4\r\n<ol class=\"clause\"><li>At any time the court may, for good cause, deny, restrict, or defer discovery or inspection, or grant other appropriate relief. The court may permit a party to show good cause by a written statement that the court will inspect ex parte.</li><li>If a party fails to comply with this article, the court may:<ul><li>order that party to permit the discovery or inspection; specify its time, place, and manner; and prescribe other just terms and conditions;</li><li>grant a continuance;</li><li>prohibit that party from introducing the undisclosed evidence; or</li><li>enter any other order that is just under the circumstances.</li></ul></li></ol>",
                "source": "No. 6 of 2022, Article 15",
                "note": "",
                "articleId": "GcgTT"
              },
              {
                "article": "Subpoena",
                "content": "Section 1\r\nA subpoena must state the court's name, the title of the proceeding, and command the witness to attend and testify at the time and place the subpoena specifies.\r\nSection 2\r\n<ol class=\"clause\"><li>A subpoena may order the witness to produce any books, papers, documents, data, videos, or other objects the subpoena designates. The court may direct the witness to produce the designated items in court before trial or before they are to be offered in evidence. When the items arrive, the court may permit the parties and their attorneys to inspect all or part of them.</li><li>On motion made promptly, the court may quash or modify the subpoena if compliance would be unreasonable or oppressive.</li><li>After a complaint, indictment, or information is filed, a subpoena requiring the production of personal or confidential information about a victim may be served on a third party only by court order. Before entering the order and unless there are exceptional circumstances, the court must require giving notice to the victim so that the victim can move to quash or modify the subpoena or otherwise object.</li></ol>\r\nSection 3\r\nThe court may hold in contempt a witness who, without adequate excuse, disobeys a subpoena issued by the court.\r\nSection 4\r\nNo party may subpoena a statement of a witness or of a prospective witness under this article. [BFSC] governs the production of the statement.",
                "source": "No. 6 of 2022, Article 16",
                "note": "",
                "articleId": "5kFzQ"
              },
              {
                "article": "Pretrial Conference",
                "content": "On its own, or on a party's motion, the court may hold one or more pretrial conferences to promote a fair and expeditious trial. When a conference ends, the court must prepare and file a memorandum of any matters agreed to during the conference. The government may not use any statement made during the conference by the defendant or the defendant's attorney unless it is in writing and is signed by the defendant and the defendant's attorney.",
                "source": "No. 6 of 2022, Article 17",
                "note": "",
                "articleId": "nWWFY"
              }
            ]
          },
          {
            "part": "Venue",
            "content": [
              {
                "article": "Place of Prosecution and Trial",
                "content": "Section 1\r\nFor challenging the jury, the process shall be conducted anonymously—digitally or physically—with the public able to observe the process as a whole without exposing the jurors’ identity.\r\nSection 2\r\nThe place of Prosecution and Trial shall be a text channel on Discord with all citizens able to view but not allowed to text in it. During the Trial, all people who participate in the trial shall be given the right to text in the stated channel. \r\nSection 3\r\nA separate group direct message shall be created with the judge and the jurors before the trial to give instructions to the jury.  \r\nSection 4\r\nIf one or many parties are unable to participate in the trial on Discord, the court shall be arranged in an appropriate place, digitally or physically, and have proper equipment to present in any medium that the evidence may require. The jury deliberation place shall be private and isolated from the court or any interference. ",
                "source": "No. 6 of 2022, Article 18",
                "note": "",
                "articleId": "f5GS8"
              }
            ]
          },
          {
            "part": "Trial",
            "content": [
              {
                "article": "Jury or Non-Jury Trial",
                "content": "Section 1\r\nIf the defendant is entitled to a jury trial, the trial must be by the jury unless:<ol class=\"clause\"><li>the defendant waives a jury trial in writing;</li><li>the government consents; and</li><li>the court approves.</li></ol>\r\nSection 2\r\n<ol class=\"clause\"><li>A jury consists of 3 persons unless this article provides otherwise.</li><li>At any time before the verdict, the parties may, with the court's approval, stipulate in writing that:<ul><li>the jury may consist of fewer than 3 persons; or</li><li>a jury of fewer than 3 persons may return a verdict if the court finds it necessary to excuse a juror for good cause after the trial begins.</li></ul></li><li>After the jury has retired to deliberate, the court may permit a jury of fewer than 3 persons to return a verdict, even without a stipulation by the parties, if the court finds good cause to excuse a juror.</li></ol>\r\nSection 3\r\nIn a case tried without a jury, the court must find the defendant guilty or not guilty. If a party requests before the finding of guilty or not guilty, the court must state its specific findings of fact in open court or in a written decision or opinion.",
                "source": "No. 6 of 2022, Article 19",
                "note": "",
                "articleId": "rJ1lV"
              },
              {
                "article": "Trial Jurors",
                "content": "Section 1\r\n<ol class=\"clause\"><li>The court may examine prospective jurors or may permit the attorneys for the parties to do so.</li><li>If the court examines the jurors, it must permit the attorneys for the parties to:<ul><li>ask further questions that the court considers proper; or</li><li>submit further questions that the court may ask if it considers them proper.</li></ul></li></ol>\r\nSection 2\r\nEach side is entitled to 3 peremptory challenges to prospective jurors. The court may allow additional peremptory challenges to multiple defendants, and may allow the defendants to exercise those challenges separately or jointly.\r\nSection 3\r\n<ol class=\"clause\"><li>The court may impanel up to 3 alternate jurors to replace any jurors who are unable to perform or who are disqualified from performing their duties.</li><li>The procedure to select the jury shall be proceed as follow: <ul><li>Alternate jurors must have the same qualifications and be selected and sworn in the same manner as any other juror.</li><li>Alternate jurors replace jurors in the same sequence in which the alternates were selected. An alternate juror who replaces a juror has the same authority as the other jurors.</li></ul></li><li>The court may retain alternate jurors after the jury retires to deliberate. The court must ensure that a retained alternate does not discuss the case with anyone until that alternate replaces a juror or is discharged. If an alternate replaces a juror after deliberations have begun, the court must instruct the jury to begin its deliberations anew.</li><li>Each side is entitled to an additional peremptory challenge to prospective alternate jurors. These additional challenges may be used only to remove alternate jurors.</li></ol>",
                "source": "No. 6 of 2022, Article 20",
                "note": "",
                "articleId": "Z7VV5"
              },
              {
                "article": "Judge's Disability",
                "content": "Section 1\r\nAny qualified person designated in writing may preside over a case in place of a judge if that judge cannot preside over that case due to some disabilities.\r\nSection 2\r\nIn the event of a judge’s disability and no alternate judge is available, the trial may be postponed to a later date with the agreement of all parties.",
                "source": "No. 6 of 2022, Article 21",
                "note": "",
                "articleId": "zlNl6"
              },
              {
                "article": "Taking Testimony",
                "content": "In every trial the testimony of witnesses must be taken in open court, unless otherwise provided by a statute.",
                "source": "No. 6 of 2022, Article 22",
                "note": "",
                "articleId": "tVb79"
              },
              {
                "article": "Foreign Law Determination",
                "content": "A party intending to raise an issue of foreign law must provide the court and all parties with reasonable written notice. Issues of foreign law are questions of law, but in deciding such issues a court may consider any relevant material or source—including testimony—without regard to the Evidence Act.",
                "source": "No. 6 of 2022, Article 23",
                "note": "",
                "articleId": "ZJvN2"
              },
              {
                "article": "Producing a Witness's Statement",
                "content": "Section 1\r\nAfter a witness other than the defendant has testified on direct examination, the court, on motion of a party who did not call the witness, must order an attorney for the government or the defendant and the defendant's attorney to produce, for the examination and use of the moving party, any statement of the witness that is in their possession and that relates to the subject matter of the witness's testimony.\r\nSection 2\r\nIf the entire statement relates to the subject matter of the witness's testimony, the court must order that the statement be delivered to the moving party.\r\nSection 3\r\nIf the party who called the witness claims that the statement contains information that is privileged or does not relate to the subject matter of the witness's testimony, the court must inspect the statement. After excising any privileged or unrelated portions, the court must order delivery of the redacted statement to the moving party. If the defendant objects to an excision, the court must preserve the entire statement with the excised portion indicated, under seal, as part of the record.\r\nSection 4\r\nThe court may recess the proceedings to allow time for a party to examine the statement and prepare for its use.\r\nSection 5\r\nIf the party who called the witness disobeys an order to produce or deliver a statement, the court must strike the witness's testimony from the record. If an attorney for the government disobeys the order, the court must declare a mistrial if justice so requires.\r\nSection 6\r\nAs used in this article, a witness's “statement” means:<ol class=\"clause\"><li>a written statement that the witness makes and signs, or otherwise adopts or approves;</li><li>a substantially verbatim, contemporaneously recorded recital of the witness's oral statement that is contained in any recording or any transcription of a recording; or</li><li>the witness's statement to a grand jury, however taken or recorded, or a transcription of such a statement.</li></ol>",
                "source": "No. 6 of 2022, Article 24",
                "note": "",
                "articleId": "0vrRL"
              },
              {
                "article": "Mistrial",
                "content": "Before ordering a mistrial, the court must give each defendant and the government an opportunity to comment on the propriety of the order, to state whether that party consents or objects, and to suggest alternatives.",
                "source": "No. 6 of 2022, Article 25",
                "note": "",
                "articleId": "XLg6T"
              },
              {
                "article": "Motion for a Judgment of Acquittal",
                "content": "Section 1\r\nAfter the government closes its evidence or after the close of all the evidence, the court on the defendant's motion must enter a judgment of acquittal of any offense for which the evidence is insufficient to sustain a conviction. The court may on its own consider whether the evidence is insufficient to sustain a conviction. If the court denies a motion for a judgment of acquittal at the close of the government's evidence, the defendant may offer evidence without having reserved the right to do so.\r\nSection 2\r\nThe court may reserve decision on the motion, proceed with the trial (where the motion is made before the close of all the evidence), submit the case to the jury, and decide the motion either before the jury returns a verdict or after it returns a verdict of guilty or is discharged without having returned a verdict. If the court reserves decision, it must decide the motion on the basis of the evidence at the time the ruling was reserved.\r\nSection 3\r\n<ol class=\"clause\"><li>A defendant may move for a judgment of acquittal, or renew such a motion, within 7 days after a guilty verdict or after the court discharges the jury, whichever is later.</li><li>If the jury has returned a guilty verdict, the court may set aside the verdict and enter an acquittal. If the jury has failed to return a verdict, the court may enter a judgment of acquittal.</li><li>A defendant is not required to move for a judgment of acquittal before the court submits the case to the jury as a prerequisite for making such a motion after jury discharge.</li></ol>",
                "source": "No. 6 of 2022, Article 26",
                "note": "",
                "articleId": "HCHl5"
              },
              {
                "article": "Closing Argument",
                "content": "Closing arguments proceed in the following order:\r\n* the government argues;\r\n* the defense argues; and\r\n* the government rebuts.",
                "source": "No. 6 of 2022, Article 27",
                "note": "",
                "articleId": "prl49"
              },
              {
                "article": "Jury Instructions",
                "content": "Section 1\r\nAny party may request in writing that the court instruct the jury on the law as specified in the request. The request must be made at the close of the evidence or at any earlier time that the court reasonably sets. When the request is made, the requesting party must furnish a copy to every other party.\r\nSection 2\r\nThe court must inform the parties before closing arguments how it intends to rule on the requested instructions.\r\nSection 3\r\nThe court may instruct the jury before or after the arguments are completed, or at both times.\r\nSection 4\r\nA party who objects to any portion of the instructions or to a failure to give a requested instruction must inform the court of the specific objection and the grounds for the objection before the jury retires to deliberate. An opportunity must be given to object out of the jury's hearing and, on request, out of the jury's presence. Failure to object in accordance with this article precludes appellate review, except as permitted under [8 BFSC 68].",
                "source": "No. 6 of 2022, Article 28",
                "note": "",
                "articleId": "YF3Gb"
              },
              {
                "article": "Jury Verdict",
                "content": "Section 1\r\nThe jury must return its verdict to a judge in open court. The verdict must be unanimous.\r\nSection 2\r\n<ol class=\"clause\"><li>If there are multiple defendants, the jury may return a verdict at any time during its deliberations as to any defendant about whom it has agreed.</li><li>If the jury cannot agree on all counts as to any defendant, the jury may return a verdict on those counts on which it has agreed.</li><li>If the jury cannot agree on a verdict on one or more counts, the court may declare a mistrial on those counts. The government may retry any defendant on any count on which the jury could not agree.</li></ol>\r\nSection \r\nA defendant may be found guilty of any of the following:<ol class=\"clause\"><li>an offense necessarily included in the offense charged;</li><li>an attempt to commit the offense charged; or</li><li>an attempt to commit an offense necessarily included in the offense charged, if the attempt is an offense in its own right.</li></ol>\r\nSection 4\r\nAfter a verdict is returned but before the jury is discharged, the court must on a party's request, or may on its own, poll the jurors individually. If the poll reveals a lack of unanimity, the court may direct the jury to deliberate further or may declare a mistrial and discharge the jury.",
                "source": "No. 6 of 2022, Article 29",
                "note": "",
                "articleId": "1MDGN"
              }
            ]
          },
          {
            "part": "Post-conviction Procedures",
            "content": [
              {
                "article": "Sentencing and Judgment",
                "content": "Section 1\r\n<ol class=\"clause\"><li>The court must impose sentence without unnecessary delay.</li><li>The court may, for good cause, change any time limits prescribed in this article.</li></ol>\r\nSection 2\r\n<ol class=\"clause\"><li>Before imposing sentence, the court must:<ul><li>provide the defendant's attorney an opportunity to speak on the defendant's behalf;</li><li>address the defendant personally in order to permit the defendant to speak or present any information to mitigate the sentence;</li><li>provide an attorney for the government an opportunity to speak equivalent to that of the defendant's attorney, and to recommend a sentence based on facts; and</li><li>provide the defendant’s attorney an opportunity to comment on or object to the recommendation of the attorney for the government.</li></ul></li><li>Before imposing sentence, the court must address any victim of the crime who is present at sentencing and must permit the victim to be reasonably heard.</li></ol>\r\nSection 3\r\n<ol class=\"clause\"><li>If the defendant was convicted, after sentencing the court must advise the defendant of the right to appeal the conviction.</li><li>After sentencing, the court must advise the defendant of any right to appeal the sentence.</li></ol>\r\nSection 4\r\nIn the judgment of conviction, the court must set forth the jury verdict or the court's findings, the adjudication, and the sentence. If the defendant is found not guilty or is otherwise entitled to be discharged, the court must so order. The judge must sign the judgment.",
                "source": "No. 6 of 2022, Article 30",
                "note": "",
                "articleId": "TYGDT"
              },
              {
                "article": "New Trial",
                "content": "Section 1\r\nUpon the defendant's motion, the court may vacate any judgment and grant a new trial if the interest of justice so requires. If the case was tried without a jury, the court may take additional testimony and enter a new judgment.\r\nSection 2\r\n<ol class=\"clause\"><li>Any motion for a new trial grounded on newly discovered evidence must be filed within 1 year after the verdict or finding of guilty. If an appeal is pending, the court may not grant a motion for a new trial until the appellate court remands the case.</li><li>Any motion for a new trial grounded on any reason other than newly discovered evidence must be filed within 14 days after the verdict or finding of guilty.</li></ol>",
                "source": "No. 6 of 2022, Article 31",
                "note": "",
                "articleId": "Rmjtf"
              },
              {
                "article": "Correcting or Reducing a Sentence",
                "content": "Section 1\r\nWithin 14 days after sentencing, the court may correct a sentence that resulted from arithmetical, technical, or other clear error.\r\nSection 2\r\n<ol class=\"clause\"><li>Upon the government's motion made within 9 months of sentencing, the court may reduce a sentence if the defendant, after sentencing, provided substantial assistance in investigating or prosecuting another person.</li><li>Upon the government's motion made more than 9 months after sentencing, the court may reduce a sentence if the defendant's substantial assistance involved:<ul><li>information not known to the defendant until one year or more after sentencing;</li><li>information provided by the defendant to the government within 9 months of sentencing, but which did not become useful to the government until more than one year after sentencing; or</li><li>information the usefulness of which could not reasonably have been anticipated by the defendant until more than 9 months after sentencing and which was promptly provided to the government after its usefulness was reasonably apparent to the defendant.</li></ul></li><li>In evaluating whether the defendant has provided substantial assistance, the court may consider the defendant's presentence assistance.</li><li>When acting under [this Article] Section 2, the court may reduce the sentence to a level below the minimum sentence established by statute.</li></ol>\r\nSection 3\r\nAs used in this article, “sentencing” means the announcement of the sentence.",
                "source": "No. 6 of 2022, Article 32",
                "note": "",
                "articleId": "BVmHr"
              },
              {
                "article": "Clerical Error",
                "content": "After giving any notice it considers appropriate, the court may at any time correct a clerical error in a judgment, order, or other part of the record, or correct an error in the record arising from oversight or omission.",
                "source": "No. 6 of 2022, Article 33",
                "note": "",
                "articleId": "rqFsD"
              },
              {
                "article": "Staying a Sentence",
                "content": "If the defendant is pending appeal and does not pose any imminent danger to the State and its population, the court must stay the imposed sentence.",
                "source": "No. 6 of 2022, Article 34",
                "note": "",
                "articleId": "mLtPK"
              },
              {
                "article": "Preventive Detention",
                "content": "Section 1\r\nWithin 14 days of the sentence of the defendant expiring and authorized by the court in the original sentencing, upon a motion of the Government, the court may appropriately impose an additional sentence for the purpose of protecting the State and its population from the danger of the defendant if the defendant is proven to continuously be an imminent threat to the State and its population.\r\nSection 2\r\nBefore imposing any additional sentence, the court must take appropriate measures as provided by [8 BFSC 55] Section 2.",
                "source": "No. 6 of 2022, Article 35",
                "note": "",
                "articleId": "JNF9L"
              }
            ]
          },
          {
            "part": "Supplementary and Special Proceedings",
            "content": [
              {
                "article": "Criminal Contempt",
                "content": "Section 1\r\nAny person who commits criminal contempt may be punished for that contempt after prosecution on notice.\r\nSection 2\r\nThe court must request that the contempt be prosecuted by an attorney for the government, unless the interest of justice requires the appointment of another attorney. If the government declines the request, the court must appoint another attorney to prosecute the contempt.\r\nSection 3\r\nA person being prosecuted for criminal contempt is entitled to a jury trial in any case in which statutes so provide. Upon a finding or verdict of guilty, the court must impose the punishment.\r\nSection 4\r\nNotwithstanding any other provision of this article, the court may summarily punish a person who commits criminal contempt in its presence if the judge saw or heard the contemptuous conduct and so certifies. The contempt order must recite the facts, and be signed by the judge.",
                "source": "No. 6 of 2022, Article 36",
                "note": "",
                "articleId": "Wdfk4"
              }
            ]
          },
          {
            "part": "General Provisions",
            "content": [
              {
                "article": "Defendant's Presence",
                "content": "The presence of the defendant shall be required in every trial, unless:<ol class=\"clause\"><li>there already is a counsel representing the defendant;</li><li>the defendant declines to be present;</li><li>the defendant is no longer a citizen of the State;</li><li>measures which prevent the defendant to be present are imposed on the defendant according to [this Article] and the court finds those measures are necessary for the duration of the trial;</li><li>the court finds the defendant unfit for trial; or</li><li>the court finds the defendant in criminal contempt of court.</li></ol>",
                "source": "No. 6 of 2022, Article 37",
                "note": "",
                "articleId": "N5s2z"
              },
              {
                "article": "Right to and Appointment of Counsel",
                "content": "A defendant who is unable to obtain counsel is, upon request, entitled to have counsel appointed by the court to represent the defendant at every stage of the proceeding.",
                "source": "No. 6 of 2022, Article 38",
                "note": "",
                "articleId": "JjTX1"
              },
              {
                "article": "Computing Time",
                "content": "Section 1\r\nThis article applies in computing any time period specified in this act, or court order, or in any statute that does not specify a method of computing time.\r\nSection 2\r\nWhen the period is stated in days or a longer unit of time:\r\n* exclude the day of the event that triggers the period;\r\n* count every day; and\r\n* include the last day of the period.\r\nSection 3\r\nWhen the period is stated in hours:\r\n* begin counting immediately on the occurrence of the event that triggers the period; and\r\n* count every hour.",
                "source": "No. 6 of 2022, Article 39",
                "note": "",
                "articleId": "BWj8R"
              },
              {
                "article": "Temporary suspension of a sentence of ban for trial",
                "content": "The court may temporarily suspend any sentence or order of ban previously imposed on an individual for the purpose of attending a trial as a defendant or witness and for the duration of that said trial if it deems fit. Any individual with ban suspended under this article may only be allowed to enter the State under heavy restrictions and supervision, and only for the purpose of attending trial.",
                "source": "No. 6 of 2022, Article 40",
                "note": "",
                "articleId": "WwMfL"
              },
              {
                "article": "Motions",
                "content": "Section 1\r\n​​A party applying to the court for an order must do so by motion.\r\nSection 2\r\n​​A motion must state the grounds on which it is based and the relief or order sought.",
                "source": "No. 6 of 2022, Article 41",
                "note": "",
                "articleId": "GCQ55"
              },
              {
                "article": "Dismissal",
                "content": "Section 1\r\nThe government may, with leave of court, dismiss an indictment, information, or complaint. The government may not dismiss the prosecution during trial without the defendant's consent.\r\nSection 2\r\nThe court may dismiss an indictment, information, or complaint if unnecessary delay occurs in:\r\n* presenting a charge to a grand jury;\r\n* filing an information against a defendant; or\r\n* bringing a defendant to trial.",
                "source": "No. 6 of 2022, Article 42",
                "note": "",
                "articleId": "4XMn8"
              },
              {
                "article": "Privacy Protection For Filings Made with the Court",
                "content": "Unless the court orders otherwise, any information concerning an individual’s real identity or security must be redacted.",
                "source": "No. 6 of 2022, Article 43",
                "note": "",
                "articleId": "9SB2C"
              },
              {
                "article": "Prompt Disposition",
                "content": "Scheduling preference must be given to criminal proceedings as far as practicable.",
                "source": "No. 6 of 2022, Article 44",
                "note": "",
                "articleId": "CVWjk"
              },
              {
                "article": "Harmless and Plain Error",
                "content": "Section 1\r\nAny error, defect, irregularity, or variance that does not affect substantial rights must be disregarded.\r\nSection 2\r\nA plain error that affects substantial rights may be considered even though it was not brought to the court's attention.",
                "source": "No. 6 of 2022, Article 45",
                "note": "",
                "articleId": "0k15f"
              },
              {
                "article": "Gallery",
                "content": "Section 1\r\nIt is at the discretion of the court whether or not a public gallery is included at a trial.\r\nSection 2\r\nIf, at any point during the trial, the court finds that there is no way in which orderly conduct of business can be carried out due to the presence of a member of, or the whole gallery, the court may order any member of, or the whole gallery be removed for the remainder of the trial; or find any member of, or the whole gallery in criminal contempt in accordance with [8 BFSC 61].",
                "source": "No. 6 of 2022, Article 46",
                "note": "",
                "articleId": "NlVsf"
              },
              {
                "article": "Records",
                "content": "After each trial, the Judge must keep a record of the criminal proceeding to the appropriate place and accessible to the public. Exhibits should all be included in the records, stating any change that was made. ",
                "source": "No. 6 of 2022, Article 47",
                "note": "",
                "articleId": "6zN2Z"
              },
              {
                "article": "When Court Is Open",
                "content": "The Court is considered always open to the public for any filing, trial, and making a motion.",
                "source": "No. 6 of 2022, Article 48",
                "note": "",
                "articleId": "4RtZX"
              },
              {
                "article": "Misdemeanors",
                "content": "Section 1\r\n<ol class=\"clause\"><li>This article applies in misdemeanor cases and on appeal to a judge, unless this article provides otherwise.</li><li>In a case involving a misdemeanor for which no sentence of ban will be imposed, the court may follow any provision of these articles that is not inconsistent with this article and that the court considers appropriate.</li><li>As used in this article, the term “misdemeanor for which no sentence of ban will be imposed” means a misdemeanor for which the court determines that, in the event of conviction, no sentence of ban will be imposed.</li></ol>\r\nSection 2\r\n<ol class=\"clause\"><li>The trial of a misdemeanor may proceed on an indictment, information, a citation or violation notice.</li><li>At the defendant's initial appearance on a misdemeanor charge, the judge must inform the defendant of the following:<ul><li>the charge, and the minimum and maximum penalties, including mute, and ban.</li><li>the right to retain counsel;</li><li>the right to request the appointment of counsel if the defendant is unable to retain counsel;</li><li>the defendant's right not to make a statement, and that any statement made may be used against the defendant; and</li><li>the right to a jury trial before a judge.</li></ul></li><li><ul><li>In a misdemeanor case, a judge may take the plea only if the defendant consents either in writing or on the record to be tried before a judge and specifically waives trial before a jury. The defendant may plead not guilty, or guilty.</li><li>In a misdemeanor case, the judge must order a defendant who does not consent to trial before a judge to appear before a jury for further proceedings.</li></ul></li></ol>\r\nSection 3\r\nThe following procedures also apply in a case involving a misdemeanor for which no sentence of ban will be imposed:<ol class=\"clause\"><li>The court must not accept a guilty plea unless satisfied that the defendant understands the nature of the charge and the maximum possible penalty.</li><li>The court must give the defendant an opportunity to be heard in mitigation and then proceed immediately to sentencing. The court may, however, postpone sentencing to allow investigation or to permit either party to submit additional information.</li><li>After imposing sentence in a case tried on a not-guilty plea, the court must advise the defendant of a right to appeal the conviction and of any right to appeal the sentence. If the defendant was convicted on a plea of guilty, the court must advise the defendant of any right to appeal the sentence.</li></ol>\r\nSection 4\r\nThe court must record any proceedings under this article by using a court reporter or a suitable recording device.\r\nSection 5\r\n[BFSC] applies to a motion for a new trial.\r\nSection 6\r\n<ol class=\"clause\"><li>Either party may appeal an order of a judge to a jury within 3 days. The party appealing must file a notice specifying the order being appealed and must serve a copy on the adverse party.</li><li>A defendant may appeal a judge's judgment of conviction or sentence to a jury within 14 days of its entry. To appeal, the defendant must file a notice specifying the judgment being appealed and must serve a copy on an attorney for the government.</li><li>The record consists of the original papers and exhibits in the case; any transcript, tape, or other recording of the proceedings; and a certified copy of the docket entries. For purposes of the appeal, a copy of the record of the proceedings must be made available to the defendant.</li><li>The defendant is not entitled to a trial de novo by a jury. The scope of the appeal is the same as in an appeal to the court of appeals from a judgment entered by a judge.</li><li>[BFSC] applies to a stay of a judgment of conviction or sentence. The court may release the defendant pending appeal under the law relating to release pending appeal to a court of appeals.</li></ol>",
                "source": "No. 6 of 2022, Article 49",
                "note": "",
                "articleId": "28xkj"
              },
              {
                "article": "Victim’s Rights",
                "content": "Section 1<ol class=\"clause\"><li>The government must use its best efforts to give the victim reasonable, accurate, and timely notice of any public court proceeding involving the crime.</li><li>The court must not exclude a victim from a public court proceeding involving the crime, unless the court determines by clear and convincing evidence that the victim's testimony would be materially altered if the victim heard other testimony at that proceeding. In determining whether to exclude a victim, the court must make every effort to permit the fullest attendance possible by the victim and must consider reasonable alternatives to exclusion. The reasons for any exclusion must be clearly stated on the record.</li><li>The court must permit a victim to be reasonably heard at any public proceeding in the court concerning release, plea, or sentencing involving the crime.</li></ol>Section 2<ol class=\"clause\"><li>The court must promptly decide any motion asserting a victim's rights described in this article.</li><li>A victim's rights described in this article may be asserted by the victim, the victim's lawful representative, or the attorney for the government.</li><li>If the court finds that the number of victims makes it impracticable to accord all of them their rights described in this article, the court must fashion a reasonable procedure that gives effect to these rights without unduly complicating or prolonging the proceedings.</li><li>A failure to afford a victim any right described in this article is not grounds for a new trial.</li></ol>",
                "source": "No. 6 of 2022, Article 50",
                "note": "",
                "articleId": "2k5ch"
              },
              {
                "article": "Amendment",
                "content": "The Chief Justice may submit any proposed amendment to this act directly to Parliament, and Parliament must proceed on the amendment at the earliest possible opportunity.",
                "source": "No. 6 of 2022, Article 51",
                "note": "",
                "articleId": "88jhV"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "title": "Foreign Affairs",
    "content": [
      {
        "chapter": "Policy Regarding Human Rights and Democracy",
        "content": [
          {
            "article": "Condition for the Establishment and Continuance of Diplomatic Relations",
            "content": "Any foreign state wishing to establish, or having established and wishing to maintain a diplomatic relationship with the Bayer Free State shall observe and ensure that democracy, the rule of law, and the basic human, civil, and political rights, freedoms, and protections be respected and protected equally among its population within its jurisdiction. ",
            "source": "No. 15 of 2022, Article 1",
            "note": "",
            "articleId": "rNzmh"
          },
          {
            "article": "Termination of Diplomatic Relations",
            "content": "The Head of State or the Prime Minister shall terminate diplomatic relations between the Bayer Free State with any foreign state that fails to maintain the condition provided by [BFSC] of this Act if deemed necessary. ",
            "source": "No. 15 of 2022, Article 2",
            "note": "",
            "articleId": "kPyBF"
          },
          {
            "article": "Sanctions against Foreign States which Fail to Observe the Core Principles",
            "content": "The Head of State or the Prime Minister shall impose sanctions in any form, including but not limited to denying entry for the citizens of, termination of economic trades, or any appropriate action permitted by statutes or international conventions or treaties on any foreign state that fails to observe and ensure that democracy, the rule of law, or the basic human, civil, and political rights, freedoms, and protections be respected and protected equally among its population within its jurisdiction. ",
            "source": "No. 15 of 2022, Article 3",
            "note": "",
            "articleId": "Tj72D"
          }
        ]
      }
    ]
  },
  {
    "title": "The Judiciary and Judicial Procedures",
    "content": [
      {
        "chapter": "Appelate Procedures",
        "content": [
          {
            "part": "Applicability",
            "content": [
              {
                "article": "Scope",
                "content": "This [Chapter] shall govern the procedure in all proceedings in the Supreme Court of the Bayer Free State, and all subsequent courts of appeals that may be established by law within the jurisdiction of the Bayer Free State.",
                "source": "No. 9 of 2022, Article 1",
                "note": "",
                "articleId": "FQVZQ"
              },
              {
                "article": "Suspension",
                "content": "On its own or a party's motion, a court of appeals may—to expedite its decision or for other good cause—suspend any provision of this [Chapter] in a particular case and order proceedings as it directs.\r\nPart II. Appeal from a Judgment or Order of a Court",
                "source": "No. 9 of 2022, Article 2",
                "note": "",
                "articleId": "xdng4"
              },
              {
                "article": "Appeal as of Right—How Taken",
                "content": "Section 1\r\n<ol class=\"clause\"><li>An appeal permitted by law as of right from a court to a court of appeals may be taken only by filing a notice of appeal within the time allowed by Article 4.</li><li>An appellant's failure to take any step other than the timely filing of a notice of appeal does not affect the validity of the appeal, but is ground only for the court of appeals to act as it considers appropriate, including dismissing the appeal.</li><li>An appeal from a judgment by a judge in a civil case is taken in the same way as an appeal from any other court judgment.</li></ol>\r\nSection 2\r\n<ol class=\"clause\"><li>When two or more parties are entitled to appeal from a court judgment or order, and their interests make joinder practicable, they may file a joint notice of appeal. They may then proceed on appeal as a single appellant.</li><li>When the parties have filed separate timely notices of appeal, the appeals may be joined or consolidated by the court of appeals.</li></ol>\r\nSection 3\r\n<ol class=\"clause\"><li>The notice of appeal must:<ul><li>specify the party or parties taking the appeal by naming each one in the caption or body of the notice, but an attorney representing more than one party may describe those parties with such terms as “all plaintiffs,” “the defendants,” “the plaintiffs A, B, et al.,” or “all defendants except X”;</li><li>designate the judgment—or the appealable order—from which the appeal is taken; and</li><li>name the court to which the appeal is taken.</li></ul></li><li>The notice of appeal encompasses all orders that, for purposes of appeal, merge into the designated judgment or appealable order. It is not necessary to designate those orders in the notice of appeal.</li><li>An appellant may designate only part of a judgment or appealable order by expressly stating that the notice of appeal is so limited. Without such an express statement, specific designations do not limit the scope of the notice of appeal.</li><li>An appeal must not be dismissed for informality of form or title of the notice of appeal, or for failure to name a party whose intent to appeal is otherwise clear from the notice, or for failure to properly designate the judgment if the notice of appeal was filed after entry of the judgment and designates an order that merged into that judgment.</li></ol>\r\nSection 4\r\n<ol class=\"clause\"><li>The court must serve notice of the filing of a notice of appeal by sending a copy to each party's counsel of record—excluding the appellant's. When a defendant in a criminal case appeals, the court must also serve a copy of the notice of appeal on the defendant. The court must promptly send a copy of the notice of appeal and of the docket entries—and any later docket entries—to the court of appeals named in the notice. The court must note, on each copy, the date when the notice of appeal was filed.</li><li>The court's failure to serve notice does not affect the validity of the appeal. The court must note on the docket the names of the parties to whom the court sends copies, with the date of sending.</li></ol>",
                "source": "No. 9 of 2022, Article 3",
                "note": "",
                "articleId": "bPBhP"
              },
              {
                "article": "Appeal as of Right—When Taken",
                "content": "Section 1\r\n<ol class=\"clause\"><li>A notice of appeal must be filed in the court of appeals within 14 days after the later of:<ul><li>the entry of either the judgment or the order being appealed; or</li><li>the filing of the government's notice of appeal.</li><li>When the government is entitled to appeal, its notice of appeal must be filed in the court of appeals within 21 days after the later of:</li><li>the entry of the judgment or order being appealed; or</li><li>the filing of a notice of appeal by any defendant.</li></ul></li><li>A notice of appeal filed after the court announces a decision, sentence, or order—but before the entry of the judgment or order—is treated as filed on the date of and after the entry.</li><li>A valid notice of appeal is effective—without amendment—to appeal from an order disposing of any motions.</li><li>Upon a finding of excusable neglect or good cause, the court may—before or after the time has expired, with or without motion and notice—extend the time to file a notice of appeal for a period not to exceed 30 days from the expiration of the time otherwise prescribed by this Section.</li><li>The filing of a notice of appeal under this Section does not divest a court of jurisdiction to correct a sentence under [BFSC], nor does the filing of a motion under that section affect the validity of a notice of appeal filed before entry of the order disposing of the motion. The filing of a motion under [BFSC] does not suspend the time for filing a notice of appeal from a judgment of conviction.</li><li>A judgment or order is entered for purposes of this Section when it is entered on the docket.</li></ol>\r\nSection 2\r\nIf a notice of appeal in either a civil or a criminal case is mistakenly filed in the court of appeals, that court must note on the notice the date when it was received and send it to the court. The notice is then considered filed in the court on the date so noted.",
                "source": "No. 9 of 2022, Article 4",
                "note": "",
                "articleId": "82SjJ"
              },
              {
                "article": "Appeal by Permission",
                "content": "Section 1\r\n<ol class=\"clause\"><li>To request permission to appeal when an appeal is within the court of appeals’ discretion, a party must file a petition with the court and serve it on all other parties to the court action.</li><li>The petition must be filed within the time specified by the statute authorizing the appeal or, if no such time is specified, within the time provided by Article 4 for filing a notice of appeal.</li><li>If a party cannot petition for appeal unless the court first enters an order granting permission to do so or stating that the necessary conditions are met, the court may amend its order, either on its own or in response to a party's motion, to include the required permission or statement. In that event, the time to petition runs from entry of the amended order.</li></ol>\r\nSection 2\r\n<ol class=\"clause\"><li>The petition must include the following:<ul><li>the facts necessary to understand the question presented;</li><li>the question itself;</li><li>the relief sought;</li><li>the reasons why the appeal should be allowed and is authorized by a statute; and</li><li>an attached copy of:<ul><li>the order, decree, or judgment complained of and any related opinion or memorandum, and</li><li>any order stating the court's permission to appeal or finding that the necessary conditions are met.</li></ul></li></ul></li><li>A party may file an answer in opposition or a cross-petition within 10 days after the petition is served.</li><li>The petition and answer will be submitted without argument unless the court of appeals orders otherwise.</li></ol>",
                "source": "No. 9 of 2022, Article 5",
                "note": "",
                "articleId": "Mq34k"
              },
              {
                "article": "Release in a Criminal Case",
                "content": "Section 1\r\nThe court must state in writing the reasons for an order regarding the release or detention of a defendant in a criminal case. A party appealing from the order must file with the court of appeals a copy of the court's order and the court's statement of reasons as soon as practicable after filing the notice of appeal.\r\nSection 2\r\nAfter reasonable notice to the appellant, the court of appeals must promptly determine the appeal on the basis of the papers, affidavits, and parts of the record that the parties present or the court requires. Unless the court so orders, briefs need not be filed.\r\nSection 3\r\nThe court of appeals or one of its judges may order the defendant's release pending the disposition of the appeal.",
                "source": "No. 9 of 2022, Article 6",
                "note": "",
                "articleId": "X7wfM"
              },
              {
                "article": "The Record on Appeal",
                "content": "The following items constitute the record on appeal:\r\n<ol class=\"clause\"><li>the original papers and exhibits filed in the court;</li><li>the transcript of proceedings, if any; and</li><li>a certified copy of the docket entries prepared by the court.</li></ol>",
                "source": "No. 9 of 2022, Article 7",
                "note": "",
                "articleId": "K89rq"
              },
              {
                "article": "Forwarding the Record",
                "content": "An appellant filing a notice of appeal must do whatever else is necessary to enable the court to assemble and forward the record. If there are multiple appeals from a judgment or order, the court must forward a single record.",
                "source": "No. 9 of 2022, Article 8",
                "note": "",
                "articleId": "NH2tz"
              },
              {
                "article": "Docketing the Appeal; Filing a Representation Statement",
                "content": "Section 1\r\nUpon receiving the copy of the notice of appeal and the docket entries under Article 3, the court must docket the appeal under the title of the court action and must identify the appellant, adding the appellant's name if necessary.\r\nSection 2\r\nUnless the court of appeals designates another time, the attorney who filed the notice of appeal must, within 3 days after filing the notice, file a statement with the court naming the parties that the attorney represents on appeal.",
                "source": "No. 9 of 2022, Article 9",
                "note": "",
                "articleId": "nLXnf"
              }
            ]
          },
          {
            "part": "Review or Enforcement of an Order of an Administrative Agency, Board, Commission, or Officer",
            "content": [
              {
                "article": "Review or Enforcement of an Agency Order—How Obtained; Intervention",
                "content": "Section 1\r\n<ol class=\"clause\"><li>Review of an agency order is commenced by filing, within the time prescribed by law, a petition for review with a court of appeals authorized to review the agency order. If their interests make joinder practicable, two or more persons may join in a petition to the same court to review the same order.</li><li>The petition must:<ul><li>name each party seeking review either in the caption or the body of the petition—using such terms as “et al.,” “petitioners,” or “respondents” does not effectively name the parties;</li><li>name the agency as a respondent (even though not named in the petition, the Bayer Free State is a respondent if required by statute); and</li><li>specify the order or part thereof to be reviewed.</li></ul></li><li>In this Article “agency” includes an agency, board, commission, or officer; “petition for review” includes a petition to enjoin, suspend, modify, or otherwise review, or a notice of appeal, whichever form is indicated by the applicable statute.</li></ol>\r\nSection 2\r\n<ol class=\"clause\"><li>An application to enforce an agency order must be filed with a court of appeals authorized to enforce the order. If a petition is filed to review an agency order that the court may enforce, a party opposing the petition may file a cross-application for enforcement.</li><li>Within 7 days after the application for enforcement is filed, the respondent must serve on the applicant an answer to the application and file it with the court. If the respondent fails to answer in time, the court will enter judgment for the relief requested.</li><li>The application must contain a concise statement of the proceedings in which the order was entered, the facts upon which venue is based, and the relief requested.</li></ol>\r\nSection 3\r\nUnless a statute provides another method, a person who wants to intervene in a proceeding under this Article must file a motion for leave to intervene with the court. The motion—or other notice of intervention authorized by statute—must be filed within 21 days after the petition for review is filed and must contain a concise statement of the interest of the moving party and the grounds for intervention.",
                "source": "No. 9 of 2022, Article 10",
                "note": "",
                "articleId": "3C7Nv"
              },
              {
                "article": "The Record on Review or Enforcement",
                "content": "Section 1\r\nThe record on review or enforcement of an agency order consists of:\r\n<ol class=\"clause\"><li>the order involved;</li><li>any findings or report on which it is based; and</li><li>the pleadings, evidence, and other parts of the proceedings before the agency.</li></ol>\r\nSection 2\r\nThe parties may at any time, by stipulation, supply any omission from the record or correct a misstatement, or the court may so direct. If necessary, the court may direct that a supplemental record be prepared and filed.",
                "source": "No. 9 of 2022, Article 11",
                "note": "",
                "articleId": "6dhxJ"
              },
              {
                "article": "Filing the Record",
                "content": "Section 1\r\nThe agency must file the record with the court of appeals within 14 days after being served with a petition for review, unless the statute authorizing review provides otherwise, or within 14 days after it files an application for enforcement unless the respondent fails to answer or the court orders otherwise. The court may shorten or extend the time to file the record. The court must notify all parties of the date when the record is filed.\r\nSection 2\r\n<ol class=\"clause\"><li>The agency must file:<ul><li>the original or a certified copy of the entire record or parts designated by the parties; or</li><li>a certified list adequately describing all documents, transcripts of testimony, exhibits, and other material constituting the record, or describing those parts designated by the parties.</li></ul></li><li>The parties may stipulate in writing that no record or certified list be filed. The date when the stipulation is filed with the court of appeals is treated as the date when the record is filed.</li><li>The agency must retain any portion of the record not filed with the court. All parts of the record retained by the agency are a part of the record on review for all purposes and, if the court or a party so requests, must be sent to the court regardless of any prior stipulation.</li></ol>",
                "source": "No. 9 of 2022, Article 12",
                "note": "",
                "articleId": "8VQ5G"
              },
              {
                "article": "Stay Pending Review",
                "content": "Section 1\r\nA petitioner must ordinarily move first before the agency for a stay pending review of its decision or order.\r\nSection 2\r\nA motion for a stay may be made to the court of appeals or one of its judges.\r\n<ol class=\"clause\"><li>The motion must:<ul><li>show that moving first before the agency would be impracticable; or</li><li>state that, a motion having been made, the agency denied the motion or failed to afford the relief requested and state any reasons given by the agency for its action.</li></ul></li><li>The motion must also include:<ul><li>the reasons for granting the relief requested and the facts relied on;</li><li>originals or copies of affidavits or other sworn statements supporting facts subject to dispute; and</li><li>relevant parts of the record.</li></ul></li><li>The moving party must give reasonable notice of the motion to all parties.</li><li>The motion must be filed with the court and normally will be considered by a panel of the court. But in an exceptional case in which time requirements make that procedure impracticable, the motion may be made to and considered by a single judge.</li></ol>",
                "source": "No. 9 of 2022, Article 13",
                "note": "",
                "articleId": "6gMnf"
              },
              {
                "article": "Settlement of a Judgment Enforcing an Agency Order in Part",
                "content": "When the court files an opinion directing entry of judgment enforcing the agency's order in part, the agency must within 14 days file with the court and serve on each other party a proposed judgment conforming to the opinion. A party who disagrees with the agency's proposed judgment must within 10 days file with the court and serve the agency with a proposed judgment that the party believes conforms to the opinion. The court will settle the judgment and direct entry without further hearing or argument.",
                "source": "No. 9 of 2022, Article 14",
                "note": "",
                "articleId": "P5Jbm"
              },
              {
                "article": "Applicability of Articles to the Review or Enforcement of an Agency Order",
                "content": "All provisions of this [Chapter], except Part II and Part V, apply to the review or enforcement of an agency order. In this [Chapter], “appellant” includes a petitioner or applicant, and “appellee” includes a respondent.",
                "source": "No. 9 of 2022, Article 15",
                "note": "",
                "articleId": "y5p5R"
              }
            ]
          },
          {
            "part": "Extraordinary Writs",
            "content": [
              {
                "article": "Writs of Mandamus and Prohibition, and Other Extraordinary Writs",
                "content": "Section 1\r\n<ol class=\"clause\"><li>A party petitioning for a writ of mandamus or prohibition directed to a court must file a petition with the court and serve it on all parties to the proceeding in the trial court. All parties to the proceeding in the trial court other than the petitioner are respondents for all purposes.</li><li><ul><li>The petition must be titled “In re [name of petitioner].”</li><li>The petition must state:<ul><li>the relief sought;</li><li>the issues presented;</li><li>the facts necessary to understand the issue presented by the petition; and</li><li>the reasons why the writ should be issued.</li></ul></li><li>The petition must include a copy of any order or opinion or parts of the record that may be essential to understand the matters set forth in the petition.</li></ul></li>Upon receiving the petition, the court must docket the petition and submit it to the court.</li></ol>\r\nSection 2\r\n<ol class=\"clause\"><li>The court may deny the petition without an answer. Otherwise, it must order the respondent, if any, to answer within a fixed time.</li><li>The court must serve the order to respond on all persons directed to respond.</li><li>Two or more respondents may answer jointly.</li><li>The court of appeals may invite or order the trial-court judge to address the petition or may invite an amicus curiae to do so. The trial-court judge may request permission to address the petition but may not do so unless invited or ordered to do so by the court of appeals.</li><li>If briefing or argument is required, the court must advise the parties, and when appropriate, the trial-court judge or amicus curiae.</li><li>The proceeding must be given preference over ordinary civil cases.</li></ol>\r\nSection 3\r\nAn application for an extraordinary writ other than one provided for in Section 1 of this Article must be made by filing a petition with the court of appeals and serving it on the respondents. Proceedings on the application must conform, so far as is practicable, to the procedures prescribed in Section 1 and Section 2 of this Article.",
                "source": "No. 9 of 2022, Article 16",
                "note": "",
                "articleId": "fcpn0"
              }
            ]
          },
          {
            "part": "Habeas Corpus",
            "content": [
              {
                "article": "Habeas Corpus",
                "content": "An application for a writ of habeas corpus must be made to the appropriate court. If made to a court of appeals judge, the application must be transferred to the appropriate court. If a court denies an application made or transferred to it, renewal of the application before a court of appeals judge is not permitted. The applicant may appeal to the court of appeals from the court's order denying the application.",
                "source": "No. 9 of 2022, Article 17",
                "note": "",
                "articleId": "yD1DH"
              },
              {
                "article": "Custody or Release of a Detainee in a Habeas Corpus Proceeding",
                "content": "Section 1\r\nWhile a decision not to release a detainee is under review, the court or judge rendering the decision, or the court of appeals, or the Supreme Court, or a judge or justice of either court, may order that the detainee be:\r\n<ol class=\"clause\"><li>detained appropriately; or</li><li>released on personal recognizance, with or without surety.</li></ol>\r\nSection 2\r\nWhile a decision ordering the release of a detainee is under review, the detainee must—unless the court or judge rendering the decision, or the court of appeals, or the Supreme Court, or a judge or justice of either court orders otherwise—be released on personal recognizance, with or without surety.\r\nSection 3\r\nAn initial order governing the detainee’s custody or release, including any recognizance or surety, continues in effect pending review unless for special reasons shown to the court of appeals or the Supreme Court, or to a judge or justice of either court, the order is modified or an independent order regarding custody, release, or surety is issued.",
                "source": "No. 9 of 2022, Article 18",
                "note": "",
                "articleId": "KpMkP"
              }
            ]
          },
          {
            "part": "General Provisions",
            "content": [
              {
                "article": "Computing and Extending Time",
                "content": "​​Section 1\r\nThis article applies in computing any time period specified in this [Chapter], or court order, or in any statute that does not specify a method of computing time.\r\nSection 2\r\nWhen the period is stated in days or a longer unit of time:\r\n<ol class=\"clause\"><li>exclude the day of the event that triggers the period;</li><li>count every day; and</li><li>include the last day of the period.</li></ol>\r\nSection 3\r\nWhen the period is stated in hours:\r\n<ol class=\"clause\"><li>begin counting immediately on the occurrence of the event that triggers the period; and</li><li>count every hour.</li></ol>",
                "source": "No. 9 of 2022, Article 19",
                "note": "",
                "articleId": "yHv6K"
              },
              {
                "article": "Motions",
                "content": "Section 1\r\nA party applying to the court for an order must do so by motion.\r\nSection 2\r\nA motion must state the grounds on which it is based and the relief or order sought.",
                "source": "No. 9 of 2022, Article 20",
                "note": "",
                "articleId": "m1CcS"
              },
              {
                "article": "Citing Judicial Dispositions",
                "content": "A court may not prohibit or restrict the citation of judicial opinions, orders, judgments, or other written dispositions.",
                "source": "No. 9 of 2022, Article 21",
                "note": "",
                "articleId": "MlTCm"
              },
              {
                "article": "Appeal Conferences",
                "content": "The court may direct the attorneys—and, when appropriate, the parties—to participate in one or more conferences to address any matter that may aid in disposing of the proceedings, including simplifying the issues and discussing settlement. A judge or other person designated by the court may preside over the conference. Before a settlement conference, the attorneys must consult with their clients and obtain as much authority as feasible to settle the case. The court may, as a result of the conference, enter an order controlling the course of the proceedings or implementing any settlement agreement.",
                "source": "No. 9 of 2022, Article 22",
                "note": "",
                "articleId": "1rfQ6"
              },
              {
                "article": "En Banc Determination",
                "content": "Section 1\r\nA majority of the court of appeals judges who are in regular active service and who are not disqualified may order that an appeal or other proceeding be heard or reheard by the court of appeals en banc. An en banc hearing or rehearing is not favored and ordinarily will not be ordered unless:\r\n<ol class=\"clause\"><li>en banc consideration is necessary to secure or maintain uniformity of the court's decisions; or</li><li>the proceeding involves a question of exceptional importance.</li></ol>\r\nSection 2\r\nA party may petition for a hearing or rehearing en banc.\r\n<ol class=\"clause\"><li>The petition must begin with a statement that either:the panel decision conflicts with a decision of the Supreme Court or of the court to which the petition is addressed (with citation to the conflicting case or cases) and consideration by the full court is therefore necessary to secure and maintain uniformity of the court's decisions; orthe proceeding involves one or more questions of exceptional importance, each of which must be concisely stated; for example, a petition may assert that a proceeding presents a question of exceptional importance if it involves an issue on which the panel decision conflicts with the authoritative decisions of other court of appeals that have addressed the issue.\r\nSection 3\r\nA petition that an appeal be heard initially en banc must be filed by the date when the appellee's brief is due. A petition for a rehearing en banc must be filed within the time prescribed by Article 26 for filing a petition for rehearing.\r\nSection 4\r\nA vote need not be taken to determine whether the case will be heard or reheard en banc unless a judge calls for a vote.",
                "source": "No. 9 of 2022, Article 23",
                "note": "",
                "articleId": "QZTGB"
              },
              {
                "article": "Entry of Judgment; Notice",
                "content": "Section 1\r\nA judgment is entered when it is noted on the docket. The court must prepare, sign, and enter the judgment:\r\n<ol class=\"clause\"><li>after receiving the court's opinion—but if settlement of the judgment's form is required, after final settlement; or</li><li>if a judgment is rendered without an opinion, as the court instructs.</li></ol>\r\nSection 2\r\nOn the date when judgment is entered, the court must serve on all parties a copy of the opinion—or the judgment, if no opinion was written—and a notice of the date when the judgment was entered.",
                "source": "No. 9 of 2022, Article 24",
                "note": "",
                "articleId": "mp67B"
              },
              {
                "article": "Frivolous Appeal",
                "content": "If a court of appeals determines that an appeal is frivolous, it may, after a separately filed motion or notice from the court and reasonable opportunity to respond, award just damages and single or double costs to the appellee.",
                "source": "No. 9 of 2022, Article 25",
                "note": "",
                "articleId": "tvJqv"
              },
              {
                "article": "Petition for Panel Rehearing",
                "content": "Section 1\r\nUnless the time is shortened or extended by order, a petition for panel rehearing may be filed within 14 days after entry of judgment. \r\nSection 2\r\nThe petition must state with particularity each point of law or fact that the petitioner believes the court has overlooked or misapprehended and must argue in support of the petition. Argument is not permitted.\r\nSection 3\r\nUnless the court requests, no response to a petition for panel rehearing is permitted. Ordinarily, rehearing will not be granted in the absence of such a request.\r\nSection 4\r\nIf a petition for panel rehearing is granted, the court may do any of the following:\r\n<ol class=\"clause\"><li>make a final disposition of the case without reargument;</li><li>restore the case to the calendar for reargument or resubmission; or</li><li>issue any other appropriate order.</li></ol>",
                "source": "No. 9 of 2022, Article 26",
                "note": "",
                "articleId": "gSYGP"
              },
              {
                "article": "Voluntary Dismissal",
                "content": "The court of appeals may dismiss the appeal on the filing of a stipulation signed by all parties or on the appellant's motion with notice to all parties.",
                "source": "No. 9 of 2022, Article 27",
                "note": "",
                "articleId": "7Ggyd"
              },
              {
                "article": "Case Involving a Constitutional Question When the Bayer Free State or any Possession is Not a Party",
                "content": "If a party questions the constitutionality of an Act of Parliament in a proceeding in which the Bayer Free State or its agency, officer, or employee is not a party in an official capacity, the questioning party must give written notice to the court of appeals immediately upon the filing of the record or as soon as the question is raised in the court of appeals. The court must then certify that fact to an attorney for the Government.",
                "source": "No. 9 of 2022, Article 28",
                "note": "",
                "articleId": "0n6nz"
              },
              {
                "article": "Amendment",
                "content": "The Chief Justice may submit any proposed amendment to this [Chapter] directly to Parliament, and Parliament must proceed on the amendment at the earliest possible opportunity.",
                "source": "No. 9 of 2022, Article 29",
                "note": "",
                "articleId": "SyRk7"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "title": "Voting, Referendums, and Elections",
    "content": [
      {
        "chapter": "Scope",
        "content": [
          {
            "article": "Scope",
            "content": "This [Title] shall govern the procedures taken in the period before, during, and after elections of the Head of State or Members of Parliament in the Bayer Free State as required by the Constitution, and any other extraordinary elections authorized by law.",
            "source": "No. 7 of 2022, Article 1",
            "note": "",
            "articleId": "fJf9t"
          }
        ]
      },
      {
        "chapter": "Election Commission",
        "content": [
          {
            "article": "Establishment",
            "content": "For the purpose of organizing elections, there shall be an independent Election Commission.",
            "source": "No. 7 of 2022, Article 2",
            "note": "",
            "articleId": "3byQy"
          },
          {
            "article": "Composition",
            "content": "The Election Commission shall have at least two members selected by Parliament, and shall be subjected to scrutiny as any other officer.",
            "source": "No. 7 of 2022, Article 3",
            "note": "",
            "articleId": "X1D8B"
          },
          {
            "article": "Powers and Duties",
            "content": "The Election Commission shall have the powers and duties of:\r\n<ol class=\"clause\"><li>Organizing, and administering the candidate registration process;</li><li>Administering, and regulating election campaigns;</li><li>Organizing, administering, and certifying elections;</li><li>Resolving matters and disputes related to elections;</li><li>Assist and advise courts in matters involving elections; and</li><li>Regularly report to Parliament.</li></ol>",
            "source": "No. 7 of 2022, Article 4",
            "note": "",
            "articleId": "f0ytj"
          }
        ]
      },
      {
        "chapter": "Vote Recording Instrument",
        "content": [
          {
            "article": "Instrument",
            "content": "The instrument for recording votes in elections shall be a Discord bot account along with its scripts authorized by the Election Commission.",
            "source": "No. 7 of 2022, Article 5",
            "note": "",
            "articleId": "VxYHj"
          },
          {
            "article": "Purpose",
            "content": "The instrument shall be utilized in elections to record ballots from voters, and to store those ballots anonymously to await hand counting.",
            "source": "No. 7 of 2022, Article 6",
            "note": "",
            "articleId": "YXmbC"
          },
          {
            "article": "Access",
            "content": "The account and scripts of the instrument shall only be accessible to Members of the Election Commission and those authorized by it for the purpose of editing and maintenance of the scripts and account.",
            "source": "No. 7 of 2022, Article 7",
            "note": "",
            "articleId": "3vXGw"
          },
          {
            "article": "GitHub Repository",
            "content": "Section 1\r\nThe scripts of the instrument along with all records of past elections shall be stored on a GitHub repository controlled by the Election Commission which shall remain public for the purpose of viewing, downloading, and analyzing. \r\nSection 2\r\nThe version of the scripts stored in the main branch of the GitHub repository shall be the only version of the scripts authorized to control the instrument for the purpose of recording votes in elections.\r\nSection 3\r\nCredentials such as secret tokens and keys shall not be subjected to the requirement of being publicly disclosed as provided by Section 1 of this Article.",
            "source": "No. 7 of 2022, Article 8",
            "note": "",
            "articleId": "0hF1C"
          },
          {
            "article": "Hosting",
            "content": "For the purpose of recording votes, the instrument shall be hosted locally by a Member of the Election Commission authorized.",
            "source": "No. 7 of 2022, Article 9",
            "note": "",
            "articleId": "YrGGn"
          },
          {
            "article": "Anonymity ",
            "content": "Any identification recorded by the instrument shall only be stored after being irreversibly hashed by a publicly disclosed algorithm; shall not be stored in association with any ballots; and shall only be stored for the purpose of preventing multiple ballots from being submitted by the same voter.",
            "source": "No. 7 of 2022, Article 10",
            "note": "",
            "articleId": "Wnpkl"
          },
          {
            "article": "Record",
            "content": "Any ballots submitted to the instrument shall be stored in a file, which shall not be altered by any person; shall not have its content disclosed until the closing of the poll; and shall be published in full after the certification of the election results.",
            "source": "No. 7 of 2022, Article 11",
            "note": "",
            "articleId": "kTNk8"
          },
          {
            "article": "Provisions for Alternate Vote Recording Methods",
            "content": "Under extraordinary circumstances where utilizing the usual instrument for recording votes in elections is highly impractical or impossible, an alternate method of recording votes which ensures anonymity and trust as much as possible under the circumstances may be authorized by the Elections Commission to be utilized and to have the full legality as the usual instrument.",
            "source": "No. 7 of 2022, Article 12",
            "note": "",
            "articleId": "VpF44"
          }
        ]
      },
      {
        "chapter": "Preparations for Election",
        "content": [
          {
            "article": "Candidate Registration",
            "content": "Any qualified person wishing to run in an election shall register with the Election Commission within the period of time allotted by the Commission, during which the Commission shall always be considered open for registration. The period shall be no longer than thirty days, and no shorter than fourteen days.",
            "source": "No. 7 of 2022, Article 13",
            "note": "",
            "articleId": "g3Ptp"
          },
          {
            "article": "Candidate Withdrawal",
            "content": "Any registered candidate wishing to withdraw from an election shall notify the Election Commission within the period of time allotted by the Commission, during which the Commission shall always be considered open for notification of withdrawal. The period shall be no longer than thirty days, and no shorter than fourteen days.",
            "source": "No. 7 of 2022, Article 14",
            "note": "",
            "articleId": "9bCs5"
          },
          {
            "article": "Ballot Order",
            "content": "The order of appearance of candidates on the ballot shall be randomly determined by the Election Commission. The process shall be streamed in a voice channel for members of the public to spectate.",
            "source": "No. 7 of 2022, Article 15",
            "note": "",
            "articleId": "X1N9S"
          },
          {
            "article": "Instrument Test",
            "content": "Within three days before the election, a test of the instrument shall be carried out by the Elections Commission. A mock ballot shall be used in the test and the ballots cast shall hold no legal value. Prior to the test, an announcement shall be made to the public, clearly stating that the mock election and ballots hold no legal value.",
            "source": "No. 7 of 2022, Article 16",
            "note": "",
            "articleId": "MGVF7"
          },
          {
            "article": "Announcement",
            "content": "Upon determining the dates for registration, withdrawal, campaigning, and election, and upon any candidate registering and resigning, a public announcement shall be made from the Election Commission to the public at the earliest possible opportunity.",
            "source": "No. 7 of 2022, Article 17",
            "note": "",
            "articleId": "SKTFf"
          },
          {
            "article": "Postponement",
            "content": "On grounds of concern of fraud raised, technical errors, or other extraordinary circumstances, the Election Commission may postpone the election for no more than fourteen days. An announcement stating the reason for the postponement and the new election dates shall be made to the public at the earliest possible opportunity.",
            "source": "No. 7 of 2022, Article 18",
            "note": "",
            "articleId": "ns4Cr"
          }
        ]
      },
      {
        "chapter": "Campaigning",
        "content": [
          {
            "article": "Campaigning Period",
            "content": "Campaigning shall only be conducted within a period of time allotted by the Election Commission. The period shall be no longer than fourteen days, and no shorter than five days, and the campaigning period shall not include the day on which the election is held.",
            "source": "No. 7 of 2022, Article 19",
            "note": "",
            "articleId": "KDFYq"
          },
          {
            "article": "Campaigning Channel",
            "content": "Campaigning shall only be conducted in a channel or a set of channels of the guild authorized by the Election Commission. The number of channels authorized for campaigning shall not exceed three.",
            "source": "No. 7 of 2022, Article 20",
            "note": "",
            "articleId": "yPmQC"
          },
          {
            "article": "Prohibition of Use of Official Positions, State-Owned Channels, and Facilities",
            "content": "No campaigning authorized by or connected to any candidate shall be conducted in an official capacity by any office, nor shall it be conducted in any State-owned channels or using State-owned facilities.",
            "source": "No. 7 of 2022, Article 21",
            "note": "",
            "articleId": "rkBGn"
          },
          {
            "article": "Prohibition of Disruptive Campaigning",
            "content": "No campaigning authorized by or connected to any candidate shall be conducted in the direct message with any person without prior consent, or be conducted in any channel of the guild in a disruptive, malicious, or unfair manner.",
            "source": "No. 7 of 2022, Article 22",
            "note": "",
            "articleId": "wjWB2"
          },
          {
            "article": "Dissolution of Parliament",
            "content": "At the start of the campaigning period of a parliamentary election, Parliament shall be dissolved.",
            "source": "No. 7 of 2022, Article 23",
            "note": "",
            "articleId": "D0zmj"
          },
          {
            "article": "Prohibition of Certain Executive Orders and Legislation Being Enacted",
            "content": "During the campaigning period, or on the day of the election, no executive order or legislation concerning the composition, functions, duties, and powers of the Election Commission, election procedures, the number of elected candidates, or qualifications of voters, and candidates may be enacted. Nor shall executive orders or legislation which are part of any candidate’s campaign be enacted during the campaigning period, or on the day of the election.",
            "source": "No. 7 of 2022, Article 24",
            "note": "",
            "articleId": "YpfZ1"
          },
          {
            "article": "Exceptions during Crisis",
            "content": "In times of crisis, when temporarily and properly authorized by the Head of State or the Prime Minister with no objection offered by the reassembled Parliament, Parliament shall not need to be dissolved or shall be reassembled, and [BFSC] shall not apply. Election shall be postponed until the end of the crisis.",
            "source": "No. 7 of 2022, Article 25",
            "note": "",
            "articleId": "pgbZq"
          },
          {
            "article": "Disqualification of Candidate",
            "content": "At any point during the campaigning period and the election, a candidate violating any article of this Act shall be disqualified and removed from the ballot by the Election Commission. An announcement stating the name of the candidate disqualified and the reason for disqualification shall be made to the public at the earliest possible opportunity. A candidate disqualified by the Election Commission may petition for an appeal to the Supreme Court within seven days after the disqualification.",
            "source": "No. 7 of 2022, Article 26",
            "note": "",
            "articleId": "zXjPw"
          },
          {
            "article": "Candidate Removal after the Determination of Ballot Order",
            "content": "In the event that a candidate withdraws or is removed for reasons of death, illness, other disabilities, termination of citizenship, or disqualification after the determination of the ballot order, the name of such candidate shall be displayed on the ballot, and votes cast for the candidate shall be valid and counted as usual. In the event that such candidate wins, there shall be a vacancy in that office, and an election to fill such vacancy shall be held as prescribed by law.",
            "source": "No. 7 of 2022, Article 26.A",
            "note": "",
            "articleId": "jXmr7"
          }
        ]
      },
      {
        "chapter": "Election",
        "content": [
          {
            "article": "Date and Time of Election",
            "content": "An election shall be held on a Saturday or a Sunday, or on any other date when it is definitively known that a substantial percentage of voters are available for voting. Poll shall be open from 8 AM to 10 PM UTC+7. An election shall be held no less than seven days and no more than fourteen days before the end of the term of the incumbent of the office being elected, unless in consequence of the unexpected removal from office of the incumbent.",
            "source": "No. 7 of 2022, Article 27",
            "note": "",
            "articleId": "8twyf"
          },
          {
            "article": "Poll Opening",
            "content": "When poll opens, the instrument shall be started and affirmed as working normally, and an announcement shall be made to the public, stating that poll is open, the time poll closes, and the final list of candidates.",
            "source": "No. 7 of 2022, Article 28",
            "note": "",
            "articleId": "1T23M"
          },
          {
            "article": "Poll Monitoring",
            "content": "During the election, the Election Commission shall regularly monitor the instrument and the candidates.",
            "source": "No. 7 of 2022, Article 29",
            "note": "",
            "articleId": "mC8KL"
          },
          {
            "article": "Poll Closing",
            "content": "Fifteen minutes before poll closes, a public announcement shall be made by the Election Commission. When poll closes, an announcement shall be made, the instrument shall be stopped and the certification of results shall start without unnecessary delay.",
            "source": "No. 7 of 2022, Article 30",
            "note": "",
            "articleId": "8ZsCg"
          }
        ]
      },
      {
        "chapter": "Certification of Election Results",
        "content": [
          {
            "article": "Public Viewing",
            "content": "The process of certifying the election results shall be streamed in a voice channel for the public to spectate.",
            "source": "No. 7 of 2022, Article 31",
            "note": "",
            "articleId": "FxH89"
          },
          {
            "article": "Recording Vote Counting",
            "content": "The results and counting process shall be carried out and documented step by step by the Election Commission.",
            "source": "No. 7 of 2022, Article 32",
            "note": "",
            "articleId": "vmFjG"
          },
          {
            "article": "Publication of Results",
            "content": "Upon completing the certification of results, without unnecessary delay, the results along with the documentation of the counting process shall be published in full to the public, and the winners of the election shall be declared. ",
            "source": "No. 7 of 2022, Article 33",
            "note": "",
            "articleId": "7W0Wf"
          },
          {
            "article": "Clerical Errors",
            "content": "Within seven days after the announcement of the results, the Election Commission may correct the documentation of the counting process or the results that resulted from arithmetical, technical, or other clear errors.",
            "source": "No. 7 of 2022, Article 34",
            "note": "",
            "articleId": "15LrF"
          },
          {
            "article": "Provisions for Alternate Methods of Counting Votes",
            "content": "Under extraordinary circumstances where opening the counting vote process for public viewing or publishing the documentation of the counting process is highly impractical or impossible, an alternate method of counting votes which ensures anonymity and trust as much as possible under the circumstances may be authorized by the Elections Commission to be utilized and to have the full legality as the usual process.",
            "source": "No. 7 of 2022, Article 35",
            "note": "",
            "articleId": "0f45L"
          }
        ]
      },
      {
        "chapter": "Transfer of Power",
        "content": [
          {
            "article": "Head of State Transfer of Power",
            "content": "The new Head of State shall assume the Office and ownership of the guild at 9 AM the day following the announcement of results.",
            "source": "No. 7 of 2022, Article 36",
            "note": "",
            "articleId": "rGMD7"
          },
          {
            "article": "New Parliament Formation",
            "content": "The new Members of Parliaments shall assume Office and a new Parliament shall be formed and opened at 9 AM the day following the announcement of results.",
            "source": "No. 7 of 2022, Article 37",
            "note": "",
            "articleId": "NPcXn"
          },
          {
            "article": "Inauguration Time",
            "content": "The elected candidate shall assume their office at 9 AM the day following the announcement of the results.",
            "source": "No. 7 of 2022, Article 37.A",
            "note": "",
            "articleId": "4j5d6"
          }
        ]
      },
      {
        "chapter": "Overturning Election and New Election",
        "content": [
          {
            "article": "Grounds for New Election",
            "content": "Any suspicion, allegation, or report of fraud or any wrongdoing at any point of the pre-election, election, post-election that is imminently likely to influence the outcome of the election shall be grounds for consideration of overturning the election and organizing a new election.",
            "source": "No. 7 of 2022, Article 38",
            "note": "",
            "articleId": "x6Xld"
          },
          {
            "article": "Hearing before and Permission from the Supreme Court",
            "content": "Any party connected to the election, or the Election Commission, on any ground described in [BFSC] of this Act, may petition the Supreme Court to grant permission for a new election within fourteen days after the announcement of results. All concerned parties and the Election Commission shall be given an opportunity to investigate, present evidence and arguments before the Supreme Court before a decision.",
            "source": "No. 7 of 2022, Article 39",
            "note": "",
            "articleId": "fyqT4"
          },
          {
            "article": "New Election",
            "content": "If the Supreme Court finds sufficient cause for a new election to be organized and does give permission to do so, a new election shall be held by the Election Commission as provided by this Act.",
            "source": "No. 7 of 2022, Article 40",
            "note": "",
            "articleId": "PszR2"
          },
          {
            "article": "New Election in Case of a Tie",
            "content": "If the outcome of an election is inconclusive and no clear winner can be determined, the results of the election shall be invalidated, and the Election Commission shall organize and hold a new election in which only candidates registered in the original election shall participate under the manners prescribed by this Act. If there are less than three candidates in a tie, the result shall be determined by a majority vote. In the event that a second attempt of an election fails to produce a conclusive result, a new election in which all citizens are entitled to register shall be organized and held by the Election Commission under the manner described by this Act.",
            "source": "No. 7 of 2022, Article 40.A",
            "note": "",
            "articleId": "dkjNl"
          }
        ]
      }
    ]
  },
  {
    "title": "Sovereign Possessions",
    "content": [
      {
        "subtitle": "The Constituent State of Fidelissma",
        "content": [
          {
            "chapter": "General Provisions",
            "content": [
              {
                "article": "Scope",
                "content": "This [Subtitle] shall govern all of the power of the governing body in the Constituent State of Fidelissma.",
                "source": "No. 17 of 2022, Article 1",
                "note": "",
                "articleId": "zC5FS"
              },
              {
                "article": "Status of Bayer Legislation",
                "content": "The Constitution of the Bayer Free State, the legislations enacted both before and after the enactment of [No. 7 of 2021], court orders, case laws thereof shall apply equally on the Constituent State of Fidelissma and its subjects.",
                "source": "No. 7 of 2021, Article 3",
                "note": "",
                "articleId": "bJWrm"
              },
              {
                "article": "Server Owner must comply to the Law",
                "content": "The person owning the server on which hosts Fidelissma shall comply and act accordingly with the laws of the Bayer Free State.",
                "source": "No. 7 of 2021, Article 5",
                "note": "",
                "articleId": "y0JkM"
              }
            ]
          },
          {
            "chapter": "Establishment of Fidelissma",
            "content": [
              {
                "article": "Establishment",
                "content": "The Constituent State of Fidelissma shall hereby be declared to be in possession of the Bayer Free State.",
                "source": "No. 7 of 2021, Article 1",
                "note": "",
                "articleId": "4RVRl"
              },
              {
                "article": "Composition",
                "content": "The Constituent State of Fidelissma shall consist of the Minecraft world known as \"the SMP\" being hosted on the address jiagai.aternos.me, or any other addresses which shall be amended to [No. 7 of 2021].",
                "source": "No. 7 of 2021, Article 2",
                "note": "",
                "articleId": "3P575"
              }
            ]
          },
          {
            "chapter": "Withdrawal",
            "content": [
              {
                "article": "Withdrawal from Bayer Posession",
                "content": "Should the subjects of Fidelissma wish to withdraw from this union with the Bayer Free State, a fair and secret referendum shall be held among the subjects, and with a three quarters majority, [No. 7 of 2021] shall be nullified.",
                "source": "No. 7 of 2021, Article 7",
                "note": "",
                "articleId": "pznqM"
              }
            ]
          },
          {
            "chapter": "The Council of The Constituent State of Fidelissma",
            "content": [
              {
                "article": "Establishment of the Council",
                "content": "Section 1\r\nFor the purpose of carrying out governmental powers in the Constituent State of Fidelissma, the Council shall be established.",
                "source": "No. 17 of 2022, Article 2",
                "note": "",
                "articleId": "W4yHQ"
              },
              {
                "article": "Election of the Council",
                "content": "Section 1\r\nEvery year, the Council shall be dissolved and a new council shall be elected under the system of Single Transferable Vote. The number of Councilors shall be determined by a council ordinance. \r\nSection 2\r\nUpon vacancy, a new Councillor shall be elected using the Instant Runoff Voting system. The Councilor shall serve until the end of that Council. \r\nSection 3\r\nAny election established in this article shall be conducted by the Election Commission under [BFSC Subtitle] and only lawful residents of Fidelissma are allowed to vote. No person who is not a lawful resident of Fidelissma shall be a Councilor.\r\nSection 4\r\nThe election of the first Council shall take place on 14th July 2022. Until a Council is formed, any power and duty assigned to the Council by this [Subtitle] shall be assumed by the Bayer government.",
                "source": "No. 17 of 2022, Article 3",
                "note": "",
                "articleId": "7jW3y"
              },
              {
                "article": "Recall of the Council",
                "content": "Any lawful resident shall propose a referendum and such referendum shall be held in accordance with this [Subtitle] to recall any member of, or all members of the Council, and a Council election shall be triggered after such referendum succeeds.",
                "source": "No. 17 of 2022, Article 4",
                "note": "",
                "articleId": "YCSpK"
              },
              {
                "article": "Manner of Council Proceedings",
                "content": "The manner in which the Council conducts its business shall be determined by a council ordinance.",
                "source": "No. 17 of 2022, Article 5",
                "note": "",
                "articleId": "8hVXW"
              }
            ]
          },
          {
            "chapter": "Council Ordinances",
            "content": [
              {
                "article": "Constitutional and Legal Requirement",
                "content": "Any legislative or executive action taken by the Council as authorized by this [Subtitle] shall be done so by ordinance. Any ordinance issued by the Council shall not be repugnant to the Constitution of the Bayer Free State, or any act of Parliament, executive order, or court order issued by the State government. Any ordinance failing to fulfill the requirement set out by this Article shall be null and void.",
                "source": "No. 17 of 2022, Article 6",
                "note": "",
                "articleId": "v2R4H"
              },
              {
                "article": "Council Approval",
                "content": "No council ordinance shall be adopted unless approved by the majority of Councilors in session.",
                "source": "No. 17 of 2022, Article 7",
                "note": "",
                "articleId": "4L5Pg"
              },
              {
                "article": "Publication Requirement",
                "content": "No council ordinance shall be in effect unless published in a public channel whose content is visible to Fidelissma citizens. ",
                "source": "No. 17 of 2022, Article 8",
                "note": "",
                "articleId": "2sZ4X"
              },
              {
                "article": "Public Discussion Requirement",
                "content": "No council ordinance shall be in effect unless Fidelissma citizens have been given a chance to testify before the Council during a period of no less than twenty-four hours, unless an ordinance is urgently required to be adopted in response to an imminent danger or emergency.",
                "source": "No. 17 of 2022, Article 9",
                "note": "",
                "articleId": "wpBzM"
              },
              {
                "article": "Public Repeal",
                "content": "A council ordinance may be repealed in consequence of a public referendum initiated and held in the manner provided by this [Subtitle].",
                "source": "No. 17 of 2022, Article 10",
                "note": "",
                "articleId": "fn1nr"
              },
              {
                "article": "Public Proposal",
                "content": "A Fidelissma citizen may introduce a proposal for an ordinance to the Council, and the Council shall respond to a proposal within fourteen days.",
                "source": "No. 17 of 2022, Article 11",
                "note": "",
                "articleId": "0Mp3h"
              }
            ]
          },
          {
            "chapter": "The Magistrate Court",
            "content": [
              {
                "article": "Magistrates",
                "content": "The Magistrates shall be the sitting members of the Council.",
                "source": "No. 17 of 2022, Article 12",
                "note": "",
                "articleId": "cmhTh"
              },
              {
                "article": "Criminal Cases",
                "content": "The Magistrate Court shall have the power to hear cases involving matters under any criminal statute enacted by the Council and to assemble a jury for the purpose of a fair trial as prescribed by law.",
                "source": "No. 17 of 2022, Article 13",
                "note": "",
                "articleId": "p37SS"
              },
              {
                "article": "Civil Cases",
                "content": "The Magistrate Court shall have the power to hear cases involving matters under any civil statute enacted by the Council, or common law, and to assemble a jury for the purpose of a fair trial as prescribed by law.",
                "source": "No. 17 of 2022, Article 14",
                "note": "",
                "articleId": "vnbmj"
              },
              {
                "article": "Cases between Provinces; Constitutional Cases",
                "content": "The Magistrate Court shall have the power to grant petitions and decide in cases involving disputes between provinces, and cases concerning the legality or constitutionality of any provincial statute.",
                "source": "No. 17 of 2022, Article 15",
                "note": "",
                "articleId": "TzFvr"
              },
              {
                "article": "Appeals to the Magistrate Court",
                "content": "Any judicial decision made by the government of any province may be appealed to the Magistrate Court. The Magistrate Court shall have the power to grant and hear appeals from provincial or lower courts, and to make decisions regarding appeals which may override any decision by any lower court.",
                "source": "No. 17 of 2022, Article 16",
                "note": "",
                "articleId": "gDrP6"
              },
              {
                "article": "Power to Issue Warrants and Orders",
                "content": "For the purpose of a fair trial and orderly public conduct, the Magistrate Court shall have the power to issue warrants and orders as prescribed by law.",
                "source": "No. 17 of 2022, Article 17",
                "note": "",
                "articleId": "9dN33"
              },
              {
                "article": "Magistrate Court Decisions subject to Appeal to Higher Courts",
                "content": "Any decision made by the Magistrate Court may be appealed to any higher court in Fidelissma or the Bayer Free State authorized by law to hear appeals.",
                "source": "No. 17 of 2022, Article 18",
                "note": "",
                "articleId": "b2N2f"
              },
              {
                "article": "Manner of Business Conduct",
                "content": "The Magistrate Court shall be free to determine the manner in which the Magistrate Court conducts its business.",
                "source": "No. 17 of 2022, Article 19",
                "note": "",
                "articleId": "zTRmD"
              }
            ]
          },
          {
            "chapter": "Citizens’ Rights",
            "content": [
              {
                "article": "Rights, Freedoms, and Protections Granted by the Bayer Constitution",
                "content": "Citizens of Fidelissma shall fully enjoy the rights, freedoms and protections set out by the Constitution of the Bayer Free State.",
                "source": "No. 17 of 2022, Article 20",
                "note": "",
                "articleId": "K7c6n"
              },
              {
                "article": "No Removal without Law",
                "content": "No person shall be removed by means of ban, IP ban, and removal from whitelist without a warrant of a court of law, or probable cause, and may only be removed by an authorized game operator.",
                "source": "No. 17 of 2022, Article 21",
                "note": "",
                "articleId": "7RmbY"
              },
              {
                "article": "Right to Roam",
                "content": "Every person is allowed to enjoy the environment for any temporary and undisruptive acts, and collect natural resources in a non-destructive manner.",
                "source": "No. 17 of 2022, Article 22",
                "note": "",
                "articleId": "NpQtN"
              }
            ]
          },
          {
            "chapter": "Referendums",
            "content": [
              {
                "article": "Public Petition for a Referendum",
                "content": "Any lawful resident wishing to express to the Council any particular proposition shall petition the Election Commission to hold a referendum. The Commission shall hold such referendum in the manner as statutes prescribe if such petition receives at least a number of signatures which the Council defines.",
                "source": "No. 17 of 2022, Article 23",
                "note": "",
                "articleId": "VHyvY"
              },
              {
                "article": "Legal Authority of a Referendum",
                "content": "The Council shall take appropriate actions in accordance with the results of a referendum within twenty-one days of the results being announced.",
                "source": "No. 17 of 2022, Article 24",
                "note": "",
                "articleId": "3MT41"
              }
            ]
          },
          {
            "chapter": "Server Infrastructure",
            "content": [
              {
                "article": "Server Operators",
                "content": "For the purpose of maintaining the order of the infrastructure of the server, the Council may authorize any person to access server infrastructure, referred to as a “server operator”, and the person shall maintain that status at the Council’s pleasure.",
                "source": "No. 17 of 2022, Article 25",
                "note": "",
                "articleId": "VRT5d"
              },
              {
                "article": "Server Owner",
                "content": "The owner of the server shall be appointed by a majority of the Council and be granted server operator status.",
                "source": "No. 17 of 2022, Article 26",
                "note": "",
                "articleId": "gGx15"
              },
              {
                "article": "Game Settings",
                "content": "Section 1\r\nThe gamemode of all persons on the server shall be survival. A game operator may enter spectator mode for the purpose of moderation upon probable cause.\r\nSection 2 \r\nThe difficulty of the game, unless determined otherwise by the Council, shall be “Normal”.",
                "source": "No. 17 of 2022, Article 27",
                "note": "",
                "articleId": "9pG8k"
              },
              {
                "article": "IP Address",
                "content": "The IP Address of the server, unless determined otherwise by the Council, shall be “jiagai.aternos.me”.",
                "source": "No. 17 of 2022, Article 28",
                "note": "",
                "articleId": "2gqTM"
              },
              {
                "article": "Server Name",
                "content": "The name of the server shall be determined by the Council.",
                "source": "No. 17 of 2022, Article 29",
                "note": "",
                "articleId": "vDBWK"
              },
              {
                "article": "World",
                "content": "The data files of the world hosted on the server shall not be altered, replaced, or deleted in any way, unless authorized by the server owner and acknowledged by the Council for the purpose of reversing a corruption to the integrity of the world data.",
                "source": "No. 17 of 2022, Article 30",
                "note": "",
                "articleId": "jS4MX"
              },
              {
                "article": "Log",
                "content": "Server Operators shall have the duty to retain and transfer, upon the government’s request, the log of the server for the purpose of obtaining evidence.",
                "source": "No. 17 of 2022, Article 31",
                "note": "",
                "articleId": "f7SB7"
              },
              {
                "article": "Server Updates",
                "content": "The Minecraft version of the server shall not be changed unless in consequence of a Council ordinance.",
                "source": "No. 17 of 2022, Article 32",
                "note": "",
                "articleId": "4Bp7h"
              },
              {
                "article": "Software",
                "content": "Software may be installed or removed on the server when authorized by the Council.",
                "source": "No. 17 of 2022, Article 33",
                "note": "",
                "articleId": "hcDjS"
              },
              {
                "article": "Backups",
                "content": "A backup of the world files shall be made and reasonably stored at least once every twenty-four hours of the server being online, when there is a change in software, or when there is a server update.",
                "source": "No. 17 of 2022, Article 34",
                "note": "",
                "articleId": "YZd4q"
              }
            ]
          },
          {
            "chapter": "Resident Admission",
            "content": [
              {
                "article": "Requirement for Admission",
                "content": "No person shall be admitted to Fidelissma unless that person is a citizen of the Bayer Free State, or under certain circumstances explicitly allowed by a council ordinance. The Council may make additional requirements for a person to be admitted.",
                "source": "No. 17 of 2022, Article 35",
                "note": "",
                "articleId": "Tytpp"
              },
              {
                "article": "Process of Admission",
                "content": "The Council may establish a governmental body which shall administer the appropriate procedure as prescribed by law for the admission of a person wishing to be admitted to Fidelissma.",
                "source": "No. 17 of 2022, Article 36",
                "note": "",
                "articleId": "gpwSB"
              },
              {
                "article": "Status of Residents prior",
                "content": "Nothing in this [Subtitle] shall deprive the standing or legal status of any Bayer citizens who are residents of Fidelissma prior to the adoption of this [Subtitle].",
                "source": "No. 17 of 2022, Article 37",
                "note": "",
                "articleId": "khVN2"
              }
            ]
          },
          {
            "chapter": "Public Safety",
            "content": [
              {
                "article": "Game Operators",
                "content": "For the purpose of ensuring public safety and enforcing laws and the fairness of the game, the Council may appoint certain persons to be granted operator status in-game, and the person shall hold the status at the Council’s pleasure.",
                "source": "No. 17 of 2022, Article 38",
                "note": "",
                "articleId": "Tqd0H"
              },
              {
                "article": "Emergency Actions",
                "content": "With probable cause, in order to ensure public safety and order, a game operator may, in any way, remove any person from the game or server, intervene by means of commands, or alter certain structures, without prior authorization by a court. Such action shall be reported by a game operator within twenty-four hours, and the court may sustain or overrule such action.",
                "source": "No. 17 of 2022, Article 39",
                "note": "",
                "articleId": "XRh64"
              }
            ]
          },
          {
            "chapter": "Land, Building, Property Regulation",
            "content": [
              {
                "article": "Unclaimed Land",
                "content": "Any land outside of boundaries of governmental or provincial territories, or of the property of any person may be freely claimed as provinces, or as personal property by any lawful resident of Fidelissma.",
                "source": "No. 17 of 2022, Article 40",
                "note": "",
                "articleId": "90F8Y"
              },
              {
                "article": "Property Regulation",
                "content": "The Council may make ordinances regarding ownership, extraction, protection, access, transfer, purchase, and acquisition of private property as permitted by law.",
                "source": "No. 17 of 2022, Article 41",
                "note": "",
                "articleId": "Z47Nz"
              },
              {
                "article": "Governmental Land",
                "content": "The Council may issue ordinances to create, modify, or abolish a well-defined territory upon any unclaimed land to be placed under the control of the Council.",
                "source": "No. 17 of 2022, Article 42",
                "note": "",
                "articleId": "sS05j"
              },
              {
                "article": "Council Powers over Governmental Territories",
                "content": "Within governmental territories, the Council shall have the power to regulate all buildings and properties, and any aspects essential to public and governmental interests.",
                "source": "No. 17 of 2022, Article 43",
                "note": "",
                "articleId": "QW70c"
              }
            ]
          },
          {
            "chapter": "Provinces",
            "content": [
              {
                "article": "Requirements for Province Admission",
                "content": "No territory shall be admitted as a province unless:\r\n<ol class=\"clause\"><li>it has a territory whose contiguous area is equivalent to at least four chunks;</li><li>it has a permanent population of at least one lawful resident;</li><li>it has a government which is able to conduct business with the Fidelissma government, and the governments of other provinces; and</li><li>it is able to pay an admission fee determined by the Council.</li></ol>",
                "source": "No. 17 of 2022, Article 44",
                "note": "",
                "articleId": "b8h2n"
              },
              {
                "article": "Province Admission",
                "content": "Any person wishing to establish a province shall submit to the Council a formal application which shall include the definition of the provincial boundary, and affirmation that requirements for province admission are met. The Council shall, by a majority, admit the province if it determines that all requirements have been made.",
                "source": "No. 17 of 2022, Article 45",
                "note": "",
                "articleId": "12NgG"
              },
              {
                "article": "Province Dissolution and Boundary Modification",
                "content": "No province shall be dissolved or have its boundary modified without the explicit consent of the provincial government and the approval of the Council.",
                "source": "No. 17 of 2022, Article 46",
                "note": "",
                "articleId": "DGM5S"
              },
              {
                "article": "Provincial Maritime Border",
                "content": "All provinces shall have sovereignty over any area of sea within one hundred blocks of the shoreline.",
                "source": "No. 17 of 2022, Article 47",
                "note": "",
                "articleId": "cNM0v"
              },
              {
                "article": "Province System of Government",
                "content": "All provinces shall be free to choose its system of government as long as it can conduct business with the Council and other provinces, and ensure the rights and protections of its residents as prescribed by law. No person shall be the head of government of more than one province at any given time.",
                "source": "No. 17 of 2022, Article 48",
                "note": "",
                "articleId": "344sN"
              },
              {
                "article": "Building Planning Power",
                "content": "All provinces shall have the power to regulate the construction of buildings and management of resources within their territories.",
                "source": "No. 17 of 2022, Article 49",
                "note": "",
                "articleId": "W9nHc"
              },
              {
                "article": "Council Ordinances in Provinces",
                "content": "All provinces shall have the power to enforce council ordinances. Decisions regarding council ordinances shall be subject to appeal to the Magistrate Court and higher courts.",
                "source": "No. 17 of 2022, Article 50",
                "note": "",
                "articleId": "2KQfG"
              },
              {
                "article": "Citizens’ Rights in Provinces",
                "content": "All provinces shall have the duty to uphold the rights and protections of all of its residents as provided by law.",
                "source": "No. 17 of 2022, Article 51",
                "note": "",
                "articleId": "6Y3sm"
              },
              {
                "article": "Mobility Rights",
                "content": "All persons shall be permitted to enter all provincial territories, and to freely exit provincial territories without undue burden, unless lawfully detained.",
                "source": "No. 17 of 2022, Article 52",
                "note": "",
                "articleId": "DdLtf"
              }
            ]
          },
          {
            "chapter": "Governmental Territories",
            "content": [
              {
                "article": "The Capital",
                "content": "Section 1\r\nThe Capital of Fidelissma shall be Port de Fleurs, which shall also be a seat of government for the Bayer Free State.\r\nSection 2\r\nThe territory of Port de Fleurs shall be prescribed by [BFSC].",
                "source": "No. 17 of 2022, Article 53",
                "note": "",
                "articleId": "bg4jx"
              },
              {
                "article": "Acquisition of Governmental Territories",
                "content": "The Council may acquire governmental territories by declaring a territory and define its exact boundary by a Council ordinance. The Council shall not claim any territory already part of any province unless with the consent of that province.",
                "source": "No. 17 of 2022, Article 54",
                "note": "",
                "articleId": "D7Zq3"
              },
              {
                "article": "Maritime Border",
                "content": "All governmental territories shall have sovereignty over any area of sea within one hundred blocks of the shoreline.",
                "source": "No. 17 of 2022, Article 55",
                "note": "",
                "articleId": "fXSK9"
              }
            ]
          },
          {
            "chapter": "Government Property",
            "content": [
              {
                "article": "Government Property held by the Council",
                "content": "For public and national interests, the Council may hold certain structures as property, and to make regulations upon those properties.",
                "source": "No. 17 of 2022, Article 56",
                "note": "",
                "articleId": "gWW4x"
              },
              {
                "article": "Types of Government Property",
                "content": "The Council may hold transportation, farming, generation, monument, defense, and other public infrastructures as government property.",
                "source": "No. 17 of 2022, Article 57",
                "note": "",
                "articleId": "fdZrG"
              },
              {
                "article": "Government Property Acquisition, Transfer, Purchase",
                "content": "The Council may acquire government property through construction, or by voluntary transfers or purchases from private residents, and may sell or lease government property.",
                "source": "No. 17 of 2022, Article 58",
                "note": "",
                "articleId": "7tZhn"
              },
              {
                "article": "Private Contractors",
                "content": "For the maintenance of government property, the Council may enter a fair, voluntary, and legally binding contract with a private contractor.",
                "source": "No. 17 of 2022, Article 59",
                "note": "",
                "articleId": "Yn8ST"
              }
            ]
          },
          {
            "chapter": "The Treasury",
            "content": [
              {
                "article": "The Chancellor of the Treasury",
                "content": "All currencies, unused materials, and infrastructures held as property of the Government shall be controlled by a Chancellor of the Treasury.",
                "source": "No. 17 of 2022, Article 60",
                "note": "",
                "articleId": "W07Pt"
              },
              {
                "article": "Safekeeping",
                "content": "The Chancellor shall ensure the safekeeping and the integrity in the quantity of the treasury, and take responsibility accordingly.",
                "source": "No. 17 of 2022, Article 61",
                "note": "",
                "articleId": "tJHlJ"
              },
              {
                "article": "Periodic Reports",
                "content": "Upon the request of the Council, the Chancellor shall report the quantity, state, and integrity of the treasury, and respond to inquiries from the Council thereon.",
                "source": "No. 17 of 2022, Article 62",
                "note": "",
                "articleId": "cbnP6"
              },
              {
                "article": "Expenditure",
                "content": "No money or property shall be drawn from the treasury unless in consequence of a Council ordinance. The Chancellor shall make expenditure and take revenue upon such authorization by the Council, and report upon completion.",
                "source": "No. 17 of 2022, Article 63",
                "note": "",
                "articleId": "VhXgn"
              },
              {
                "article": "Donations",
                "content": "The Chancellor shall accept willful donations in currencies, materials, or infrastructures from private citizens or entities into the treasury, and shall report to the Council such donations.",
                "source": "No. 17 of 2022, Article 64",
                "note": "",
                "articleId": "NpZjF"
              }
            ]
          },
          {
            "chapter": "Criminal Statutes",
            "content": [
              {
                "article": "Power to Create Criminal Offenses and Misdemeanors ",
                "content": "The Council, within Fidelissma, shall have the power to create and abolish criminal offenses and misdemeanors, punishments therefore, and to enforce criminal laws as statutes prescribe.",
                "source": "No. 17 of 2022, Article 65",
                "note": "",
                "articleId": "q5F9y"
              },
              {
                "article": "Jurisdiction",
                "content": "In the event a criminal offense is committed within governmental territories, or unclaimed territories, a Fidelissma court may have jurisdiction over the trial of such offense. In the event a criminal offense is committed within a provincial territory, a designated government official of that province may enforce Fidelissma criminal statutes, and a Fidelissma court may have jurisdiction over the trial of such offense. No person shall be convicted or punished of an offense for which they have already been convicted or punished by any provincial or Fidelissma court.",
                "source": "No. 17 of 2022, Article 66",
                "note": "",
                "articleId": "9JbKL"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "schedules": "Titile of this section",
    "content": [
      {
        "schedule": "An interesting title",
        "content": [
          {
            "article": "I am stupid",
            "content": "I saw a bug in my room. I want to talk about <a href=\"#crwhf\">this article</a>",
            "articleId": "XtkCh"
          }
        ]
      }
    ]
  }
]